{
  "labels": {
    "en": {
      "description": "Description:",
      "climate": "Climate:",
      "soil": "Soil:",
      "harvest_time": "Harvest Time:"
    },
    "tl": {
      "description": "Paglalarawan:",
      "climate": "Klima:",
      "soil": "Lupa:",
      "harvest_time": "Panahon ng Pag-ani:"
    }
  },
  "apple": {
    "en": {
      "name": "Apple",
      "description": "Apple (Malus domestica) is a deciduous tree fruit prized for its wide variety of flavors, textures, sizes, and colors. Apples are consumed fresh, baked, juiced, or preserved, and can be used in sauces, desserts, cider, and other processed foods. Apple trees require distinct seasons—dormancy in winter, blossom in spring, and fruit development in summer into autumn. The fruit’s flavor, crispness, and storage capacity depend heavily on cultivar, growing conditions, altitude, and orchard management.",
      "climate": "Temperate regions with cold winters (to satisfy chill‑hour requirements), frost‐free flowering periods, warm days in summer (~20‑30°C), cooler nights for flavor development. Tolerates slight frost in dormant periods but young trees and blossoms are sensitive to late spring frosts.",
      "soil": "Deep, well‑drained loamy or silt‑loam soils rich in organic matter, pH approximately 5.5‑7.5. Good moisture retention but avoid waterlogging; rootstock choice, drainage, and fertility (especially nitrogen, potassium, magnesium) are important.",
      "harvest_time": "Approximately 4‑7 months from flowering to fruit maturity depending on cultivar and climate. Harvest season generally in late summer to fall (varies by region). Fruit should be harvested when skin color is appropriate for cultivar, firmness is good, and seeds are fully developed. Post‑harvest cooling helps maintain quality."
    },
    "tl": {
      "name": "Mansanas",
      "description": "Ang Apple (Malus domestica) ay isang deciduous tree fruit na pinahahalagahan para sa malawak na iba't ibang lasa, texture, sukat, at kulay nito. Ang mga mansanas ay kinakain nang sariwa, inihurnong, nilagyan ng juice, o inipreserba, at maaaring gamitin sa mga sarsa, dessert, cider, at iba pang naprosesong pagkain. Ang mga puno ng mansanas ay nangangailangan ng mga natatanging panahon—ang dormancy sa taglamig, namumulaklak sa tagsibol, at ang pagbuo ng prutas sa tag-araw hanggang taglagas. Ang lasa, crispness, at kapasidad ng pag-iimbak ng prutas ay lubos na nakadepende sa cultivar, mga kondisyon ng paglaki, altitude, at pamamahala ng orchard.",
      "climate": "Mga mapagtimpi na rehiyon na may malamig na taglamig (upang matugunan ang mga kinakailangan sa chill-hour), mga panahon ng pamumulaklak na walang frost, mainit na araw sa tag-araw (~20‑30°C), mas malamig na gabi para sa pagbuo ng lasa. Pinahihintulutan ang bahagyang hamog na nagyelo sa mga panahon ng tulog ngunit ang mga batang puno at mga bulaklak ay sensitibo sa mga hamog na nagyelo sa huling bahagi ng tagsibol.",
      "soil": "Malalim, well-drained loamy o silt-loam soils na mayaman sa organikong bagay, pH humigit-kumulang 5.5-7.5. Magandang pagpapanatili ng kahalumigmigan ngunit iwasan ang waterlogging; Ang pagpili ng rootstock, drainage, at fertility (lalo na ang nitrogen, potassium, magnesium) ay mahalaga.",
      "harvest_time": "Approximately 4‑7 months from flowering to fruit maturity depending on cultivar and climate. Harvest season generally in late summer to fall (varies by region). Fruit should be harvested when skin color is appropriate for cultivar, firmness is good, and seeds are fully developed. Post‑harvest cooling helps maintain quality."
    }
  }, 
  "banana": {
    "en": {
      "name": "Banana",
      "description": "Banana (Musa spp.) is a perennial, herbaceous crop grown for its sweet, fleshy fruit. It is one of the world’s most widely produced fruit crops. Bananas are used fresh, in cooking (especially plantains), drying, and processing. Each pseudostem produces a single bunch; after harvest, suckers or new shoots produce the next crop. Disease management, wind protection, and high nutrient and water availability are key to good yields.",
      "climate": "Warm and humid tropical or subtropical regions; ideal daytime temperatures about 26‑30°C; sensitive to cold and frost (below ~10‑12°C can damage growth). Requires high rainfall or reliable irrigation (often 1,200‑2,500 mm/year) and humidity; full sun exposure with wind protection is beneficial.",
      "soil": "Well‑drained, fertile loamy soils rich in organic matter; pH about 5.5‑7.0. Avoid heavy clay soils or waterlogged soils. Good drainage is essential to prevent root rot. Soil should support high nutrient turnover particularly for potassium, nitrogen.",
      "harvest_time": "Bananas take about 9‑18 months from planting to first harvest, depending on variety, climate, care. From flowering to fruit maturity (bunch maturity) often 2‑4 months, depending on variety and conditions. Further ratoon crops may be harvested sooner."
    },
    "tl": {
      "name": "Saging",
      "description": "Ang saging (Musa spp.) ay isang perennial, mala-damo na pananim na pinatubo para sa matamis at mataba nitong prutas. Ito ay isa sa pinakamalawak na ani ng prutas sa mundo. Ang saging ay ginagamit sariwa, sa pagluluto (lalo na sa mga plantain), pagpapatuyo, at pagproseso. Ang bawat pseudostem ay gumagawa ng isang bungkos; pagkatapos ng pag-aani, ang mga sucker o mga bagong sanga ay nagbubunga ng susunod na pananim. Ang pamamahala sa sakit, proteksyon ng hangin, at mataas na nutrisyon at pagkakaroon ng tubig ay susi sa magagandang ani.",
      "climate": "Mainit at mahalumigmig na tropikal o subtropikal na mga rehiyon; mainam na temperatura sa araw na humigit-kumulang 26‑30°C; sensitibo sa lamig at hamog na nagyelo (sa ibaba ~10‑12°C ay maaaring makapinsala sa paglaki). Nangangailangan ng mataas na pag-ulan o maaasahang patubig (madalas na 1,200‑2,500 mm/taon) at halumigmig; Ang buong pagkakalantad sa araw na may proteksyon sa hangin ay kapaki-pakinabang.",
      "soil": "Mahusay na pinatuyo, mayabong mabuhangin na mga lupang mayaman sa organikong bagay; pH tungkol sa 5.5-7.0. Iwasan ang mabigat na luwad na lupa o mga lupang may tubig. Ang mahusay na pagpapatuyo ay mahalaga upang maiwasan ang pagkabulok ng ugat. Dapat suportahan ng lupa ang mataas na nutrient turnover lalo na para sa potassium, nitrogen.",
      "harvest_time": "Ang saging ay tumatagal ng humigit-kumulang 9‑18 buwan mula sa pagtatanim hanggang sa unang ani, depende sa uri, klima, pangangalaga. Mula sa pamumulaklak hanggang sa kapanahunan ng prutas (bunch maturity) madalas 2‑4 na buwan, depende sa iba't at kundisyon. Ang mga karagdagang pananim na ratoon ay maaaring anihin nang mas maaga."
    }
  },
  "chickpea": {
    "en": {
      "name": "Chickpea",
      "description": "Chickpea (Cicer arietinum) is an annual legume cultivated for its nutritious seeds used whole or ground in many culinary dishes. It fixes nitrogen in the soil, making it useful in crop rotations. Chickpea plants are relatively drought tolerant, but yield and seed quality depend on timely moisture, good soil fertility, and disease/pest management.",
      "climate": "Prefers semi‐arid to temperate climates; cool to moderate winters and warm, dry summers. Sensitive to frost during flowering; too high heat or drought during pod filling reduces yields. Moderate rainfall is sufficient, but excess moisture can lead to disease. Temperatures ~18‑30°C during growth are favorable, with cooler nights improving pod formation.",
      "soil": "Well‐drained soils: loamy, clay loam, or sandy loam with good organic matter. Soil should have neutral to slightly alkaline pH (~6.0‑8.0). Soils prone to waterlogging or heavy and compact clay are less ideal. Good fertility (especially phosphorus) is important. “Fixation” of nitrogen reduces need for heavy N fertilizer. ",
      "harvest_time": "Typically about 90‑120 days after sowing, depending on variety and climate. Harvest when pods are mature and dry (pods brown, seeds firm). Moisture content low to allow storage; sometimes multiple picks or drying may be needed."
    },
    "tl": {
      "name": "Chickpea",
      "description": "Ang chickpea (Cicer arietinum) ay isang taunang munggo na nilinang para sa masustansyang mga buto nito na ginagamit nang buo o giniling sa maraming culinary dish. Inaayos nito ang nitrogen sa lupa, ginagawa itong kapaki-pakinabang sa mga pag-ikot ng pananim. Ang mga halaman ng chickpea ay medyo mapagparaya sa tagtuyot, ngunit ang ani at kalidad ng buto ay nakasalalay sa napapanahong kahalumigmigan, mahusay na pagkamayabong ng lupa, at pamamahala ng sakit/peste.",
      "climate": "Mas pinipili ang semi-arid sa mapagtimpi na klima; malamig hanggang katamtamang taglamig at mainit, tuyo na tag-araw. Sensitibo sa hamog na nagyelo sa panahon ng pamumulaklak; ang sobrang init o tagtuyot sa panahon ng pagpupuno ng pod ay nakakabawas sa mga ani. Ang katamtamang pag-ulan ay sapat, ngunit ang labis na kahalumigmigan ay maaaring humantong sa sakit. Ang mga temperatura ~18‑30°C sa panahon ng paglaki ay kanais-nais, na may mas malamig na gabi na nagpapahusay sa pagbuo ng pod.",
      "soil": "Mga lupang may mahusay na pinatuyo: loamy, clay loam, o sandy loam na may magandang organikong bagay. Ang lupa ay dapat na may neutral hanggang bahagyang alkaline pH (~6.0‑8.0). Ang mga lupang madaling kapitan ng tubig o mabigat at compact na luad ay hindi gaanong perpekto. Ang mabuting pagkamayabong (lalo na ang posporus) ay mahalaga. Binabawasan ng “fixation” ng nitrogen ang pangangailangan para sa mabigat na N fertilizer.",
      "harvest_time": "Typically about 90‑120 days after sowing, depending on variety and climate. Harvest when pods are mature and dry (pods brown, seeds firm). Moisture content low to allow storage; sometimes multiple picks or drying may be needed."
    }
  },
  "coconut": {
    "en": {
      "name": "Coconut",
      "description": "Coconut (Cocos nucifera) is a tropical perennial palm valued for its multi‑purpose uses: food (coconut water, flesh), oil, coir, timber, and more. Coconut palms can live for many years, producing fruit once they mature. They are important for coastal and island agriculture, both for household consumption and commercial products. Palms are tolerant of salt spray; often part of agroforestry systems or coastal protection.",
      "climate": "Strictly tropical climates; warm, humid, frost‑free. Ideal temperatures around 25‑30°C; intolerant of cold/frost. Requires high annual rainfall (1500‑2500 mm or more); well‑distributed rainfall helps fruiting and growth. Full sun is essential; some tolerance to wind, especially coastal, but very strong winds (typhoons) can damage fronds and nuts.",
      "soil": "Sandy to loamy soils, well‑drained, with good depth to allow root penetration. Tolerates sandy coastal soils, even some salinity, so long as root zone has moisture and nutrients. Soil pH from slightly acidic to neutral (~5.5‑7.5). High organic matter helps. Avoid waterlogged or compacted soils. ",
      "harvest_time": "Coconut palms begin fruiting typically in 3‑6 years after planting, depending on variety and establishment conditions. Nuts mature in ~10‑12 months after flowering, though maturity depends on intended use (young green nuts vs mature brown coconuts). Harvesting is ongoing (multiple harvests per year) once palm reaches productivity."
    },
    "tl": {
      "name": "Niyog",
      "description": "Ang niyog (Cocos nucifera) ay isang tropikal na perennial palm na pinahahalagahan para sa maraming gamit nito: pagkain (tubig ng niyog, laman), mantika, bunot, troso, at higit pa. Ang mga niyog ay maaaring mabuhay ng maraming taon, na nagbubunga kapag sila ay hinog na. Mahalaga ang mga ito para sa agrikultura sa baybayin at isla, kapwa para sa pagkonsumo ng sambahayan at komersyal na mga produkto. Ang mga palad ay mapagparaya sa spray ng asin; kadalasang bahagi ng mga sistema ng agroforestry o proteksyon sa baybayin.",
      "climate": "Mahigpit na tropikal na klima; mainit, mahalumigmig, walang frost. Mga mainam na temperatura sa paligid ng 25‑30°C; intolerante sa malamig/lamig. Nangangailangan ng mataas na taunang pag-ulan (1500‑2500 mm o higit pa); Ang maayos na pamamahagi ng ulan ay nakakatulong sa pamumunga at paglaki. Ang buong araw ay mahalaga; ilang tolerance sa hangin, lalo na sa baybayin, ngunit ang napakalakas na hangin (bagyo) ay maaaring makapinsala sa mga fronds at nuts.",
      "soil": "Mabuhangin hanggang mabuhangin na mga lupa, mahusay na pinatuyo, na may mahusay na lalim upang payagan ang pagpasok ng ugat. Pinahihintulutan ang mabuhangin na mga lupa sa baybayin, kahit na ang ilang kaasinan, hangga't ang root zone ay may moisture at nutrients. pH ng lupa mula bahagyang acidic hanggang neutral (~5.5‑7.5). Nakakatulong ang mataas na organikong bagay. Iwasan ang natubigan o siksik na mga lupa.",
      "harvest_time": "Ang mga palma ng niyog ay karaniwang nagsisimulang mamunga sa loob ng 3‑6 na taon pagkatapos itanim, depende sa uri at kondisyon ng pagtatatag. Mature ang mga mani sa ~10‑12 na buwan pagkatapos mamulaklak, bagama't nakadepende ang maturity sa nilalayong paggamit (mga batang berdeng mani kumpara sa mature na kayumangging niyog). Ang pag-aani ay nagpapatuloy (maraming ani bawat taon) kapag umabot sa produktibo ang palm."
    }
  },
  "coffee": {
    "en": {
      "name": "Coffee",
      "description": "Coffee (Coffea spp.) refers to perennial shrubs grown for their seeds (“beans”) that are roasted and brewed as the popular beverage. Two main commercially important species are Arabica and Robusta. Coffee growing involves precise timing of flowering, cherry development, harvest, and processing. Shade, altitude, and soil fertility significantly affect flavor, yield, and bean quality. Trees need a few years to establish.",
      "climate": "Tropical to subtropical climates; coffee often grows best at higher elevations (for Arabica) where temperatures are more mild (e.g. ~15‑24°C), while Robusta tolerates higher temperature (~24‑30°C). Needs distinct wet and dry periods to induce flowering and allow drying of cherries. Sensitive to frost and extreme heat. Adequate rainfall (often 1,500‑2,500 mm/year) with dry spells during harvest are beneficial. ",
      "soil": "Deep, fertile, well‑drained soils with good organic matter. Acidic soils are preferred (pH ~5.0‑6.5), though Robusta can tolerate slightly higher. Soil structure should allow good root depth; volcanic soils are often favorable in many coffee regions. Shade trees and mulching help maintain moisture and soil health. ",
      "harvest_time": "Coffee trees typically begin producing usable harvests in about 3‑4 years after planting. Harvesting usually occurs once cherries ripen; in many regions this is once a year, or multiple harvests / pickings in parts of the tropics. The period from flowering to berry maturity is often 7‑9 months for Arabica; may be shorter for Robusta. "
    },
    "tl": {
      "name": "Kape",
      "description": "Ang kape (Coffea spp.) ay tumutukoy sa mga pangmatagalang palumpong na itinanim para sa kanilang mga buto (“beans”) na iniihaw at niluluto bilang sikat na inumin. Dalawang pangunahing komersiyal na mahalagang species ay Arabica at Robusta. Ang pagtatanim ng kape ay nagsasangkot ng tumpak na oras ng pamumulaklak, pagbuo ng cherry, pag-aani, at pagproseso. Ang lilim, altitude, at pagkamayabong ng lupa ay makabuluhang nakakaapekto sa lasa, ani, at kalidad ng bean. Ang mga puno ay nangangailangan ng ilang taon upang maitatag.",
      "climate": "Mga klimang tropiko hanggang subtropiko; Ang kape ay kadalasang pinakamahusay na tumutubo sa mas matataas na lugar (para sa Arabica) kung saan ang mga temperatura ay mas banayad (hal. ~15‑24°C), habang pinahihintulutan ng Robusta ang mas mataas na temperatura (~24‑30°C). Nangangailangan ng natatanging basa at tuyo na mga panahon upang mahikayat ang pamumulaklak at payagan ang pagpapatuyo ng mga seresa. Sensitibo sa hamog na nagyelo at matinding init. Ang sapat na pag-ulan (madalas na 1,500‑2,500 mm/taon) na may dry spells sa panahon ng pag-aani ay kapaki-pakinabang.",
      "soil": "Malalim, mataba, mahusay na pinatuyo na mga lupa na may magandang organikong bagay. Mas pinipili ang acidic na mga lupa (pH ~5.0‑6.5), kahit na ang Robusta ay maaaring tumaas nang bahagya. Ang istraktura ng lupa ay dapat magbigay ng magandang lalim ng ugat; Ang mga lupang bulkan ay madalas na pabor sa maraming rehiyon ng kape. Nakakatulong ang mga shade tree at mulching na mapanatili ang kahalumigmigan at kalusugan ng lupa.",
      "harvest_time": "Ang mga puno ng kape ay karaniwang nagsisimulang gumawa ng mga magagamit na ani sa mga 3‑4 na taon pagkatapos itanim. Karaniwang nangyayari ang pag-aani kapag hinog na ang mga cherry; sa maraming rehiyon ito ay isang beses sa isang taon, o maramihang pag-aani/pagpitas sa mga bahagi ng tropiko. Ang panahon mula sa pamumulaklak hanggang sa kapanahunan ng berry ay madalas na 7‑9 na buwan para sa Arabica; maaaring mas maikli para sa Robusta."
    }
  },
  "cotton": {
    "en": {
      "name": "Cotton",
      "description": "Cotton (Gossypium spp.) is a fiber crop whose fibers are harvested from seed bolls. It is key for textiles but also has by‑products like cottonseed oil and cake. Cotton is a seasonal annual crop, requiring moisture in early stages, dry conditions during maturation, and warm weather. Pests (like bollworms) and disease control are important. Crop rotation and soil fertility are essential.",
      "climate": "Warm to hot climates; ideal daytime temperatures ~25‑35°C, tolerates heat but sensitive to frost. Requires a long frost‑free period. Rainfall moderately low or seasonal; too much rain during boll opening causes losses. Dry conditions near harvest are beneficial. ",
      "soil": "Deep, well‑drained soils, loamy, sandy loam, fertile; neutral to slightly acidic to slightly alkaline pH (~6.0‑8.0). Good soil structure to allow root development. Avoid heavy clay or water‑logging. Adequate nutrients especially nitrogen, potassium, phosphorus. Organic matter improves yield. ",
      "harvest_time": "Usually about 5‑6 months from sowing to harvest, depending on growing season, cultivar, climate, and soil fertility. Harvest when bolls are open, fibers fluffy, with minimal moisture to avoid rot. Sometimes multiple picking rounds if staggered boll opening."
    },
    "tl": {
      "name": "Cotton",
      "description": "Ang cotton (Gossypium spp.) ay isang fiber crop na ang mga hibla ay inaani mula sa mga buto ng buto. Ito ay susi para sa mga tela ngunit mayroon ding mga by‑produkto tulad ng cottonseed oil at cake. Ang cotton ay pana-panahong taunang pananim, na nangangailangan ng kahalumigmigan sa mga unang yugto, tuyong kondisyon sa panahon ng pagkahinog, at mainit na panahon. Ang mga peste (tulad ng bollworm) at pagkontrol sa sakit ay mahalaga. Ang pag-ikot ng pananim at pagkamayabong ng lupa ay mahalaga.",
      "climate": "Mainit hanggang sa mainit na klima; perpektong temperatura sa araw ~25‑35°C, pinahihintulutan ang init ngunit sensitibo sa hamog na nagyelo. Nangangailangan ng mahabang panahon na walang hamog na nagyelo. Katamtamang mababa o pana-panahon ang pag-ulan; masyadong maraming ulan sa pagbubukas ng boll ay nagdudulot ng mga pagkalugi. Ang mga tuyong kondisyon malapit sa pag-aani ay kapaki-pakinabang.",
      "soil": "Malalim, mahusay na pinatuyo na mga lupa, mabuhangin, mabuhangin, matabang; neutral hanggang bahagyang acidic hanggang bahagyang alkaline pH (~6.0‑8.0). Magandang istraktura ng lupa upang payagan ang pag-unlad ng ugat. Iwasan ang mabigat na luad o water-logging. Sapat na nutrients lalo na ang nitrogen, potassium, phosphorus. Ang organikong bagay ay nagpapabuti ng ani.",
      "harvest_time": "Karaniwan mga 5‑6 na buwan mula sa paghahasik hanggang sa pag-aani, depende sa panahon ng pagtatanim, cultivar, klima, at pagkamayabong ng lupa. Mag-ani kapag bukas ang mga bolls, ang mga hibla ay malambot, na may kaunting kahalumigmigan upang maiwasan ang pagkabulok. Minsan maramihang picking round kung staggered boll opening."
    }
  },
  "dyut": {
    "en": {
      "name": "Jute",
      "description": "Jute (Corchorus spp.) is a major bast fiber crop grown primarily for its long, soft, and shiny fibers used in the production of textiles such as hessian cloth, gunny bags, ropes, and carpets. There are two main cultivated species: Corchorus capsularis and Corchorus olitorius. Jute is grown mainly in warm, humid regions and thrives in areas with high rainfall. It is an important crop in riverine, alluvial regions where periodic flooding improves soil fertility. Good fiber quality depends on proper retting practices and timely harvesting.",
      "climate": "Hot and humid tropical climate with high rainfall (150–200 cm) is ideal. Optimal temperatures range from 24–35°C during the growing period. High humidity (70–90%) is beneficial, especially during the early growth and retting stages. Prolonged drought or waterlogging affects growth and fiber quality. Best suited to monsoon climates with periodic rainfall.",
      "soil": "Deep, well-drained, fertile alluvial or loamy soils with good moisture-holding capacity. Slightly acidic to neutral pH (6.0–7.5) preferred. Soils should be rich in organic matter. Sandy or saline soils are not suitable. Periodic flooding in river basins replenishes soil nutrients, improving crop performance.",
      "harvest_time": "Generally harvested 100–120 days after sowing, when plants begin flowering but before seed set. Early harvesting leads to poor fiber yield, while delayed harvesting can result in coarse, lignified fibers. After harvest, stalks are bundled and submerged in water for retting (10–20 days), after which fibers are stripped, washed, and dried before processing."
    },
    "tl": {
      "name": "Jute",
      "description": "Ang jute (Corchorus spp.) ay isang pangunahing pananim ng bast fiber na pangunahing pinatubo para sa mahaba, malambot, at makintab na mga hibla nito na ginagamit sa paggawa ng mga tela tulad ng telang hessian, gunny bag, lubid, at karpet. Mayroong dalawang pangunahing nilinang species: Corchorus capsularis at Corchorus olitorius. Ang jute ay pangunahing pinatubo sa mainit, mahalumigmig na mga rehiyon at umuunlad sa mga lugar na may mataas na pag-ulan. Ito ay isang mahalagang pananim sa ilog, mga alluvial na rehiyon kung saan ang pana-panahong pagbaha ay nagpapabuti sa pagkamayabong ng lupa. Ang magandang kalidad ng hibla ay nakasalalay sa wastong mga kasanayan sa pag-retting at napapanahong pag-aani.",
      "climate": "Ang mainit at mahalumigmig na tropikal na klima na may mataas na pag-ulan (150–200 cm) ay mainam. Ang pinakamainam na temperatura ay mula 24–35°C sa panahon ng paglaki. Ang mataas na halumigmig (70–90%) ay kapaki-pakinabang, lalo na sa mga yugto ng maagang paglaki at pag-urong. Ang matagal na tagtuyot o waterlogging ay nakakaapekto sa paglaki at kalidad ng hibla. Pinakamahusay na angkop sa mga klimang monsoon na may panaka-nakang pag-ulan.",
      "soil": "Malalim, well-drained, mayabong na alluvial o loamy soil na may mahusay na moisture-holding capacity. Mas gusto ang bahagyang acidic hanggang neutral na pH (6.0–7.5). Ang mga lupa ay dapat na mayaman sa organikong bagay. Ang mabuhangin o maalat na mga lupa ay hindi angkop. Ang pana-panahong pagbaha sa mga palanggana ng ilog ay nagdaragdag ng mga sustansya sa lupa, na nagpapabuti sa pagganap ng pananim.",
      "harvest_time": "Karaniwang inaani 100–120 araw pagkatapos ng paghahasik, kapag ang mga halaman ay nagsimulang mamulaklak ngunit bago itakda ang buto. Ang maagang pag-aani ay humahantong sa mahinang ani ng hibla, habang ang pagkaantala ng pag-aani ay maaaring magresulta sa magaspang, lignified na mga hibla. Pagkatapos ng pag-aani, ang mga tangkay ay pinagsama at nilulubog sa tubig para sa pag-retting (10-20 araw), pagkatapos kung saan ang mga hibla ay hinubaran, hugasan, at tuyo bago iproseso."
    }
  },
  "grapes": {
    "en": {
      "name": "Grapes",
      "description": "Grapes (Vitis spp.) are woody perennial vines grown for their fruit, consumed fresh, dried (raisins), or used for juice/wine. Grapevine varieties vary with respect to flavor, color, size, yield, disease resistance, and climate needs. Vine training, pruning, pest/fungal disease management, and irrigation are critical. Soil fertility, drainage, and climatic conditions strongly influence sugar content, acidity, and fruit quality.",
      "climate": "Requires moderate to warm climates; many grape varieties need defined seasons with warm growing periods (20‑30°C), cooler nights for flavor and sugar accumulation, and dry weather near harvest to avoid fungal diseases. Frost is damaging to vines and blossoms. Winter dormant period is needed for many varieties. ",
      "soil": "Well‑drained loamy soils or sandy loam, with good organic matter. Soil pH generally about 5.5‑7.5. Soils with good drainage to avoid waterlogging; shallow soils or poor structure reduce root health. Deep soils help for root anchorage. Soil fertility, especially potassium, helps fruit quality. ",
      "harvest_time": "Typically 100‑120 days from flowering to harvest in many table grape varieties; can vary depending on cultivar and climate. Harvest when grapes are fully colored, sugar levels are optimal, flavor is ripe, and acidity has balanced decline. Under favorable conditions, sometimes multiple harvests or staggered picks."
    },
    "tl": {
      "name": "Ubas",
      "description": "Ang mga ubas (Vitis spp.) ay mga makahoy na pangmatagalang baging na itinanim para sa kanilang prutas, kinakain ng sariwa, pinatuyo (mga pasas), o ginagamit para sa juice/alak. Ang mga uri ng ubas ay nag-iiba-iba ayon sa lasa, kulay, laki, ani, paglaban sa sakit, at mga pangangailangan sa klima. Ang pagsasanay sa puno ng ubas, pruning, pamamahala ng peste/fungal disease, at patubig ay kritikal. Ang pagkamayabong ng lupa, drainage, at klimatikong kondisyon ay malakas na nakakaimpluwensya sa nilalaman ng asukal, kaasiman, at kalidad ng prutas.",
      "climate": "Nangangailangan ng katamtaman hanggang mainit na klima; maraming uri ng ubas ang nangangailangan ng mga tiyak na panahon na may mainit na panahon ng paglaki (20‑30°C), mas malamig na gabi para sa lasa at akumulasyon ng asukal, at tuyong panahon malapit sa pag-aani upang maiwasan ang mga fungal disease. Ang frost ay nakakasira sa mga baging at pamumulaklak. Ang panahon ng tulog ng taglamig ay kinakailangan para sa maraming mga varieties.",
      "soil": "Well‑drained loamy soils or sandy loam, with good organic matter. Soil pH generally about 5.5‑7.5. Soils with good drainage to avoid waterlogging; shallow soils or poor structure reduce root health. Deep soils help for root anchorage. Soil fertility, especially potassium, helps fruit quality.",
      "harvest_time": "Karaniwang 100‑120 araw mula sa pamumulaklak hanggang sa pag-aani sa maraming uri ng ubas sa mesa; maaaring mag-iba depende sa cultivar at klima. Pag-aani kapag ang mga ubas ay ganap na kulay, ang mga antas ng asukal ay pinakamainam, ang lasa ay hinog, at ang kaasiman ay may balanseng pagbaba. Sa ilalim ng kanais-nais na mga kondisyon, kung minsan ay maraming ani o staggered pick."
    }
  },
  "kidneybeans": {
    "en": {
      "name": "Kidneybeans",
      "description": "Kidney bean (Phaseolus vulgaris) is a widely cultivated legume grown for its edible seeds, known for their kidney shape and rich protein content. It is a staple food legume used in a variety of dishes including chili, stews, and curries. There are several varieties including red, white, and speckled types. Kidney beans are typically grown as a rainfed crop and can be grown in both tropical and subtropical regions. Good yield depends on appropriate sowing time, moderate temperatures, disease control, and adequate soil fertility.",
      "climate": "Prefers warm, frost-free climates. Ideal temperature range is 18–30°C. Sensitive to frost, excessive humidity, and prolonged drought. Requires moderate rainfall (500–800 mm) during the growing season, especially during flowering and pod setting. Water stress or high humidity at flowering can reduce yield and quality.",
      "soil": "Well-drained loamy soils rich in organic matter with neutral pH (6.0–7.5). Avoid heavy clay or waterlogged soils, as root rot and fungal diseases are common under excess moisture. Soil should be well-aerated and fertile. Beans benefit from rhizobial inoculation to improve nitrogen fixation in poor soils.",
      "harvest_time": "Generally harvested 90–120 days after sowing, depending on the variety and growing conditions. Harvest when most pods are mature and dry. Delay in harvesting can lead to shattering or fungal infection, especially under humid conditions. Plants are pulled or cut, dried in the sun, and then threshed to collect the beans."
    },
    "tl": {
      "name": "Kidneybeans",
      "description": "Ang kidney bean (Phaseolus vulgaris) ay isang malawak na nilinang legume na pinatubo para sa nakakain na mga buto nito, na kilala sa hugis ng bato nito at mayaman sa protina. Ito ay isang staple food legume na ginagamit sa iba't ibang pagkain kabilang ang sili, nilaga, at kari. Mayroong ilang mga uri kabilang ang pula, puti, at batik-batik na mga uri. Ang mga kidney bean ay karaniwang itinatanim bilang isang rainfed crop at maaaring itanim sa parehong tropikal at subtropikal na mga rehiyon. Ang magandang ani ay nakasalalay sa angkop na oras ng paghahasik, katamtamang temperatura, pagkontrol sa sakit, at sapat na pagkamayabong ng lupa.",
      "climate": "Mas pinipili ang mainit-init, walang yelo na klima. Ang pinakamainam na hanay ng temperatura ay 18–30°C. Sensitibo sa hamog na nagyelo, labis na kahalumigmigan, at matagal na tagtuyot. Nangangailangan ng katamtamang pag-ulan (500–800 mm) sa panahon ng lumalagong panahon, lalo na sa panahon ng pamumulaklak at pod setting. Ang water stress o mataas na kahalumigmigan sa pamumulaklak ay maaaring makabawas sa ani at kalidad.",
      "soil": "Well-drained loamy soils na mayaman sa organikong bagay na may neutral pH (6.0–7.5). Iwasan ang mabigat na luad o mga lupang may tubig, dahil karaniwan ang pagkabulok ng ugat at mga fungal disease sa sobrang kahalumigmigan. Ang lupa ay dapat na well-aerated at mayabong. Ang mga bean ay nakikinabang mula sa rhizobial inoculation upang mapabuti ang nitrogen fixation sa mahihirap na lupa.",
      "harvest_time": "Karaniwang inaani 90–120 araw pagkatapos ng paghahasik, depende sa uri at kondisyon ng paglaki. Pag-aani kapag ang karamihan sa mga pods ay hinog na at tuyo. Ang pagkaantala sa pag-aani ay maaaring humantong sa pagkawasak o impeksiyon ng fungal, lalo na sa ilalim ng mahalumigmig na mga kondisyon. Ang mga halaman ay hinihila o pinuputol, pinatuyo sa araw, at pagkatapos ay ginigik upang kolektahin ang mga sitaw."
    }
  },
  "munggo": {
    "en": {
      "name": "Munggo",
      "description": "Munggo (also mung bean, Vigna radiata) is a fast‑growing legume crop used for its edible seeds and sprouts. It is highly valued for its nutritional quality (protein, vitamins), drought tolerance, and ability to fix nitrogen, improving soil fertility. It is often planted in rotation with staple cereals or used in intercropping systems. It has a relatively short life cycle and can produce multiple harvests or relay cropping in favourable seasons.",
      "climate": "Warm to hot climates, frost‑free. Optimal daytime temperatures around 25‑35°C, nights somewhat cooler but not below ~15‑18°C. Moderate rainfall timed well: enough moisture during germination, flowering and pod fill, but too much rain near harvest can reduce quality or cause disease. Well distributed rainfall is good or supplemental irrigation if needed.",
      "soil": "Well‑drained sandy loam or loam soils, fertile with good organic matter. Slightly acidic to neutral pH (~5.8‑7.2). Soils that retain moisture well but avoid waterlogging. Inoculation with rhizobia improves nitrogen fixation and yield. ",
      "harvest_time": "Usually about 60‑70 days from sowing to harvest, depending on variety and growing conditions. Harvest when pods are mature, mostly dry, seeds firm. Proper drying post‑harvest improves storability."
    },
    "tl": {
      "name": "Munggo",
      "description": "Ang Munggo (din ang mung bean, Vigna radiata) ay isang mabilis na lumalagong pananim ng munggo na ginagamit para sa nakakain nitong mga buto at usbong. Ito ay lubos na pinahahalagahan para sa kalidad ng nutrisyon nito (protina, bitamina), pagpapaubaya sa tagtuyot, at kakayahang ayusin ang nitrogen, pagpapabuti ng pagkamayabong ng lupa. Ito ay madalas na itinatanim sa pag-ikot na may mga staple cereal o ginagamit sa intercropping system. Ito ay may medyo maikling ikot ng buhay at maaaring gumawa ng maraming ani o relay cropping sa paborableng mga panahon.",
      "climate": "Mainit hanggang sa mainit na klima, walang frost. Pinakamainam na temperatura sa araw sa paligid ng 25‑35°C, sa mga gabi ay medyo mas malamig ngunit hindi mas mababa sa ~15‑18°C. Ang katamtamang pag-ulan ay nag-time nang maayos: sapat na kahalumigmigan sa panahon ng pagtubo, pamumulaklak at pagpuno ng pod, ngunit ang sobrang pag-ulan malapit sa pag-aani ay maaaring mabawasan ang kalidad o magdulot ng sakit. Ang maayos na pamamahagi ng ulan ay mabuti o pandagdag na patubig kung kinakailangan.",
      "soil": "Well-drained sandy loam o loam soils, mataba na may magandang organikong bagay. Bahagyang acidic hanggang neutral pH (~5.8‑7.2). Mga lupa na nagpapanatili ng kahalumigmigan ngunit iniiwasan ang waterlogging. Ang inoculation na may rhizobia ay nagpapabuti sa nitrogen fixation at yield.",
      "harvest_time": "Karaniwan mga 60‑70 araw mula sa paghahasik hanggang sa pag-aani, depende sa iba't-ibang at lumalagong kondisyon. Pag-aani kapag ang mga pod ay hinog na, karamihan ay tuyo, ang mga buto ay matatag. Ang wastong pagpapatuyo pagkatapos ng pag-aani ay nagpapabuti sa pag-iimbak."
    }
  },
  "monggo": {
    "en": {
      "name": "Mongo",
      "description": "Mongo, commonly known as mung bean (Vigna radiata), is a protein-rich pulse crop widely consumed in the Philippines and other Asian countries. It is used in a variety of sweet and savory dishes, such as stews, soups, and desserts. Mongo is highly valued for its short growing cycle, high nutritional value, and ability to improve soil fertility through nitrogen fixation. It is well-suited to smallholder farming systems and often grown during the dry or summer season as a catch crop.",
      "climate": "Grows best in warm, tropical to subtropical climates. Optimal temperatures are between 25–35°C. Requires a frost-free period and performs well in areas with moderate rainfall (600–1000 mm) that is well-distributed during the crop cycle. Sensitive to waterlogging but moderately drought-tolerant. Moisture stress during flowering and pod formation can affect yields.",
      "soil": "Prefers well-drained loamy or sandy loam soils with a neutral to slightly acidic pH (6.0–7.5). Avoid heavy clay and saline soils. Fertile soils rich in organic matter support better growth. Proper land preparation and weed control are essential for good crop establishment.",
      "harvest_time": "Usually harvested 60–90 days after sowing. Harvest when most pods have matured and turned dark or dry. Delayed harvesting can lead to pod shattering. Plants are cut or uprooted, sun-dried, and then threshed to extract the beans. Mongo is often grown for both food and sprouting purposes."
    },
    "tl": {
      "name": "Mongo",
      "description": "Ang Mongo, na karaniwang kilala bilang mung bean (Vigna radiata), ay isang pananim na mayaman sa protina na malawakang ginagamit sa Pilipinas at iba pang mga bansa sa Asya. Ginagamit ito sa iba't ibang matatamis at malasang pagkain, tulad ng nilaga, sopas, at panghimagas. Ang Mongo ay lubos na pinahahalagahan para sa maikling paglaki nito, mataas na nutritional value, at kakayahang mapabuti ang pagkamayabong ng lupa sa pamamagitan ng nitrogen fixation. Ito ay angkop sa mga sistema ng pagsasaka ng maliliit at madalas na lumalago sa panahon ng tagtuyot o tag-araw bilang isang pananim na panghuli.",
      "climate": "Pinakamahusay na lumalaki sa mainit-init, tropikal hanggang subtropikal na klima. Ang pinakamainam na temperatura ay nasa pagitan ng 25–35°C. Nangangailangan ng panahon na walang hamog na nagyelo at mahusay na gumaganap sa mga lugar na may katamtamang pag-ulan (600–1000 mm) na mahusay na ipinamamahagi sa panahon ng crop cycle. Sensitibo sa waterlogging ngunit katamtamang tagtuyot-tolerant. Ang stress ng kahalumigmigan sa panahon ng pamumulaklak at pagbuo ng pod ay maaaring makaapekto sa mga ani.",
      "soil": "Mas pinipili ang well-drained loamy o sandy loam soils na may neutral hanggang bahagyang acidic pH (6.0–7.5). Iwasan ang mabigat na luad at maalat na mga lupa. Ang mga matabang lupa na mayaman sa organikong bagay ay sumusuporta sa mas mahusay na paglaki. Ang wastong paghahanda ng lupa at pagkontrol ng damo ay mahalaga para sa mahusay na pagtatanim ng pananim.",
      "harvest_time": "Karaniwang inaani 60–90 araw pagkatapos ng paghahasik. Pag-aani kapag ang karamihan sa mga pods ay hinog na at naging madilim o tuyo. Ang pagkaantala sa pag-aani ay maaaring humantong sa pagkasira ng pod. Ang mga halaman ay pinuputol o binubunot, pinatuyo sa araw, at pagkatapos ay ginigiik upang kunin ang mga sitaw. Ang Mongo ay madalas na pinalaki para sa parehong mga layunin ng pagkain at pag-usbong."
    }
   },
  "mungbean": {
    "en": {
      "name": "Mungbean",
      "description": "Mung bean (Vigna radiata), also known as moong or green gram, is a short-duration pulse crop widely grown for its edible seeds and sprouts. It is rich in protein, easy to digest, and used in a variety of sweet and savory dishes. Mung bean is suited to tropical and subtropical regions, with good tolerance to heat and moderate drought. It is grown as a main, catch, or summer crop, often in rotation with cereals. High yield depends on proper sowing time, weed and pest control, and moisture availability during flowering and pod filling.",
      "climate": "Warm, semi-arid to tropical climates with moderate rainfall. Optimal temperature ranges from 25–35°C. It requires a frost-free period and performs well in areas with 600–1000 mm of rainfall during the growing season. Sensitive to waterlogging but moderately drought-tolerant. Flowering and pod development stages are particularly sensitive to moisture stress.",
      "soil": "Well-drained sandy loam to loamy soils with neutral to slightly acidic pH (6.0–7.5). Avoid heavy clay or saline soils. The crop benefits from soils with good organic content and moderate fertility. Proper drainage is critical to avoid root diseases and ensure good root development. Seedbed should be well-prepared and weed-free.",
      "harvest_time": "Usually harvested 60–90 days after sowing, depending on variety and season. Harvest when most pods have turned black or brown and are dry. Delayed harvest may lead to pod shattering and yield loss. Plants are typically cut or uprooted, then dried and threshed to collect seeds."
    },
    "tl": {
      "name": "Mungbean",
      "description": "Ang mung bean (Vigna radiata), na kilala rin bilang moong o berdeng gramo, ay isang panandaliang pulso na malawakang pinatubo para sa nakakain nitong mga buto at usbong. Ito ay mayaman sa protina, madaling matunaw, at ginagamit sa iba't ibang matamis at malasang pagkain. Ang mung bean ay angkop sa tropikal at subtropikal na mga rehiyon, na may magandang tolerance sa init at katamtamang tagtuyot. Ito ay lumago bilang isang pangunahing, huli, o pananim sa tag-araw, madalas sa pag-ikot sa mga cereal. Ang mataas na ani ay nakasalalay sa wastong oras ng paghahasik, pagkontrol ng damo at peste, at pagkakaroon ng moisture sa panahon ng pamumulaklak at pagpupuno ng pod.",
      "climate": "Mainit, semi-tuyo hanggang tropikal na klima na may katamtamang pag-ulan. Ang pinakamainam na temperatura ay mula 25–35°C. Nangangailangan ito ng frost-free period at mahusay na gumaganap sa mga lugar na may 600–1000 mm na pag-ulan sa panahon ng lumalagong panahon. Sensitibo sa waterlogging ngunit katamtamang tagtuyot-tolerant. Ang mga yugto ng pamumulaklak at pod development ay partikular na sensitibo sa moisture stress.",
      "soil": "Well-drained sandy loam hanggang loamy soils na may neutral hanggang bahagyang acidic pH (6.0–7.5). Iwasan ang mabigat na luad o maalat na mga lupa. Nakikinabang ang pananim mula sa mga lupang may magandang organikong nilalaman at katamtamang pagkamayabong. Ang wastong pagpapatuyo ay mahalaga upang maiwasan ang mga sakit sa ugat at matiyak ang mahusay na pag-unlad ng ugat. Ang punlaan ay dapat na inihanda nang mabuti at walang damo.",
      "harvest_time": "Karaniwang inaani 60–90 araw pagkatapos ng paghahasik, depende sa uri at panahon. Anihin kapag ang karamihan sa mga pod ay naging itim o kayumanggi at tuyo. Ang pagkaantala sa pag-aani ay maaaring humantong sa pagkasira ng pod at pagkawala ng ani. Ang mga halaman ay karaniwang pinuputol o binubunot, pagkatapos ay tinutuyo at giniik upang mangolekta ng mga buto."
    }
  },
  "mothbeans": {
    "en": {
      "name": "Mothbeans",
      "description": "Moth bean (Vigna aconitifolia) is a drought-tolerant legume grown in arid and semi-arid regions. It produces small, oval brown seeds rich in protein and minerals, used in traditional dishes or as sprouts. Its fast growth, low water needs, and nitrogen-fixing ability make it valuable for dryland farming and crop rotation. It is also used as fodder and supports food security in poor soils and harsh climates.",
      "climate": "Best suited to hot, dry climates with temperatures between 25–35°C and annual rainfall of 200–500 mm. It thrives in areas with short, erratic monsoons and tolerates drought well. Excessive rain or humidity can cause fungal problems. Commonly grown during the monsoon season as a short-duration crop that matures quickly before moisture runs out.",
      "soil": "Grows well in sandy or loamy soils that are well-drained, with a pH between 6.5 and 8.5. Tolerates poor, dry soils but responds to small phosphorus inputs. Waterlogging must be avoided. Its nitrogen-fixing roots improve soil fertility, making it a good crop for rotation and degraded lands with minimal inputs.",
      "harvest_time": "Ready to harvest in about 60–75 days after sowing. Plants are cut or uprooted when most pods turn brown and dry. After field drying, seeds are threshed and further dried before storage. Proper drying prevents mold and ensures long shelf life. Yields are reliable even under limited water conditions."
    },
    "tl": {
      "name": "Mothbeans",
      "description": "Ang moth bean (Vigna aconitifolia) ay isang drought-tolerant legume na lumago sa tuyo at semi-arid na rehiyon. Gumagawa ito ng maliliit, hugis-itlog na kayumanggi na buto na mayaman sa protina at mineral, na ginagamit sa mga tradisyonal na pagkain o bilang mga sprouts. Ang mabilis na paglaki nito, mababang pangangailangan ng tubig, at kakayahang mag-ayos ng nitrogen ay ginagawa itong mahalaga para sa pagsasaka sa tuyong lupa at pag-ikot ng pananim. Ginagamit din ito bilang kumpay at sumusuporta sa seguridad ng pagkain sa mahihirap na lupa at malupit na klima.",
      "climate": "Pinakamahusay na angkop sa mainit, tuyo na klima na may temperatura sa pagitan ng 25–35°C at taunang pag-ulan na 200–500 mm. Ito ay namumulaklak sa mga lugar na may maikli, mali-mali na tag-ulan at mahusay na pinahihintulutan ang tagtuyot. Ang sobrang pag-ulan o halumigmig ay maaaring magdulot ng mga problema sa fungal. Karaniwang itinatanim sa panahon ng tag-ulan bilang isang panandaliang pananim na mabilis na nahihinog bago maubos ang kahalumigmigan.",
      "soil": "Lumalaki nang maayos sa mabuhangin o mabuhangin na mga lupa na mahusay na pinatuyo, na may pH sa pagitan ng 6.5 at 8.5. Pinahihintulutan ang mahihirap, tuyong lupa ngunit tumutugon sa maliliit na phosphorus input. Dapat iwasan ang waterlogging. Ang mga ugat nito na nag-aayos ng nitrogen ay nagpapabuti sa pagkamayabong ng lupa, na ginagawa itong isang magandang pananim para sa pag-ikot at mga nasira na lupa na may kaunting input.",
      "harvest_time": "Handa nang anihin sa mga 60–75 araw pagkatapos ng paghahasik. Ang mga halaman ay pinuputol o binubunot kapag ang karamihan sa mga pod ay nagiging kayumanggi at natuyo. Pagkatapos ng pagpapatuyo sa bukid, ang mga buto ay giniik at higit pang patuyuin bago iimbak. Ang wastong pagpapatuyo ay pinipigilan ang magkaroon ng amag at tinitiyak ang mahabang buhay ng istante. Ang mga ani ay maaasahan kahit na sa ilalim ng limitadong kondisyon ng tubig."
    }
  },
  "mais": {
    "en": {
      "name": "Corn",
      "description": "Mais (corn) is a major cereal grain used for human consumption, animal feed, and industrial uses. It thrives under warm conditions, has high yield potential, and its productivity depends on sunlight, moisture, soil fertility, and pest/disease management. Corn can be grown in many environments; varieties adapted to local conditions are important.",
      "climate": "Warm, frost‑free climates; optimal daytime temperatures about 25‑32°C; nights somewhat cooler but not too cold. Requires full sun, sufficient moisture especially during germination, flowering, and grain fill. Sensitive to drought during critical growth stages (tasseling, silking).",
      "soil": "Loamy or silty loam soils, well‑drained, deep, fertile soil with good organic matter; pH ideally between ~5.8‑7.5. Soils with good water retention but not prone to waterlogging. Adequate nutrients (nitrogen especially) are important.",
      "harvest_time": "Typically around 80‑120 days from planting to harvest for many corn varieties, depending on cultivar, climate, soil fertility, and whether sweet corn or field corn. Harvest when kernels are full and grains have reached desired moisture or maturity stage."
    },
    "tl": {
      "name": "Mais",
      "description": "Ang mais (mais) ay isang pangunahing butil ng cereal na ginagamit para sa pagkonsumo ng tao, pagkain ng hayop, at mga gamit pang-industriya. Ito ay umuunlad sa ilalim ng mainit na mga kondisyon, may mataas na potensyal na ani, at ang pagiging produktibo nito ay nakasalalay sa sikat ng araw, kahalumigmigan, pagkamayabong ng lupa, at pamamahala ng peste/sakit. Maaaring itanim ang mais sa maraming kapaligiran; ang mga varieties na inangkop sa mga lokal na kondisyon ay mahalaga.",
      "climate": "Mainit, walang yelo na klima; pinakamainam na temperatura sa araw na humigit-kumulang 25‑32°C; gabi medyo malamig ngunit hindi masyadong malamig. Nangangailangan ng buong araw, sapat na kahalumigmigan lalo na sa panahon ng pagtubo, pamumulaklak, at pagpuno ng butil. Sensitibo sa tagtuyot sa panahon ng kritikal na yugto ng paglaki (tasseling, silking).",
      "soil": "Mga loamy o silty loam soils, well-drained, malalim, matabang lupa na may magandang organikong bagay; Pinakamainam na pH sa pagitan ng ~5.8‑7.5. Mga lupang may magandang pagpapanatili ng tubig ngunit hindi madaling kapitan ng tubig. Ang sapat na sustansya (lalo na ang nitrogen) ay mahalaga.",
      "harvest_time": "Karaniwang humigit-kumulang 80‑120 araw mula sa pagtatanim hanggang sa pag-aani para sa maraming uri ng mais, depende sa cultivar, klima, pagkamayabong ng lupa, at kung matamis na mais o field corn. Pag-aani kapag ang mga butil ay puno at ang mga butil ay umabot na sa nais na kahalumigmigan o yugto ng kapanahunan."
    }
  },
  "mango": {
    "en": {
      "name": "Mango",
      "description": "Mango (Mangifera indica) is a tropical tree fruit known for its sweet, juicy, aromatic fruits. There are many cultivars, varying in size, color, flavor, fiber content, and season of maturity. Mangoes are eaten fresh, processed into dried fruit, juices, jams, and many culinary products. Trees are long‑lived and may produce for many years with proper care, pruning, fertilization, and pest/disease management.",
      "climate": "Tropical to subtropical climates. Warm dry periods often help flowering; moderate to high temperatures (24‑35°C) during growth; some cooling/drier weather before flowering can improve fruit set. Mangoes are somewhat drought tolerant once established, but young trees need consistent moisture. Sensitive to frost. High humidity late in the season may increase disease risk.",
      "soil": "Well‑drained sandy loam or loam; deep soil that allows root penetration; rich in organic matter. Neutral to slightly acidic to alkaline pH (5.5‑7.5). Heavy clay soils that retain water or stay saturated are problematic. Good drainage is essential, particularly during rainy season to avoid root rot.",
      "harvest_time": "Typically 3‑5 years after planting to get good yields (depending on cultivar). Flower‑to‑harvest period ranges about 3‑6 months, depending on cultivar and climate. Harvest season usually once a year; fruit picked when mature (size, color, aroma), sometimes earlier to allow transport ripening."
    },
    "tl": {
      "name": "Mangga",
      "description": "Ang mangga (Mangifera indica) ay isang tropikal na punong prutas na kilala sa matamis, makatas, mabangong prutas. Maraming mga cultivars, iba-iba ang laki, kulay, lasa, fiber content, at season of maturity. Ang mga mangga ay kinakain nang sariwa, pinoproseso upang maging pinatuyong prutas, juice, jam, at maraming produktong culinary. Mahaba ang buhay ng mga puno at maaaring mamunga sa loob ng maraming taon na may wastong pangangalaga, pruning, pagpapabunga, at pamamahala ng peste/sakit.",
      "climate": "Tropikal hanggang subtropikal na klima. Ang mainit na tuyo na panahon ay kadalasang nakakatulong sa pamumulaklak; katamtaman hanggang mataas na temperatura (24‑35°C) sa panahon ng paglaki; ang ilang paglamig/tuyuan ng panahon bago ang pamumulaklak ay maaaring mapabuti ang set ng prutas. Ang mga mangga ay medyo mapagparaya sa tagtuyot kapag naitatag, ngunit ang mga batang puno ay nangangailangan ng pare-parehong kahalumigmigan. Sensitibo sa hamog na nagyelo. Ang mataas na kahalumigmigan sa huling bahagi ng panahon ay maaaring magpataas ng panganib sa sakit.",
      "soil": "well-drained sandy loam o loam; malalim na lupa na nagpapahintulot sa pagpasok ng ugat; mayaman sa organikong bagay. Neutral hanggang bahagyang acidic hanggang alkaline pH (5.5‑7.5). Ang mabibigat na luwad na lupa na nagpapanatili ng tubig o nananatiling puspos ay may problema. Ang maayos na drainage ay mahalaga, lalo na sa panahon ng tag-ulan upang maiwasan ang pagkabulok ng ugat.",
      "harvest_time": "Karaniwang 3‑5 taon pagkatapos itanim upang makakuha ng magandang ani (depende sa cultivar). Ang panahon ng bulaklak hanggang sa pag-aani ay humigit-kumulang 3‑6 na buwan, depende sa cultivar at klima. Ang panahon ng pag-aani ay karaniwang isang beses sa isang taon; pinipitas ang prutas kapag mature (laki, kulay, aroma), minsan mas maaga para pahinugin ang transportasyon."
    }
  },
  "muskmelon": {
    "en": {
      "name": "Muskmelon",
      "description": "Muskmelon (Cucumis melo) is a warm-season fruit that belongs to the gourd family, known for its sweet, aromatic flesh and a smooth, netted rind. Popular worldwide, muskmelons are grown for their refreshing taste, high water content, and nutritional value. They are rich in vitamins A and C, and are typically enjoyed fresh, though they can also be used in smoothies, salads, and desserts.",
      "climate": "Warm temperate to tropical; ideal temperatures between 20‑30°C. Muskmelons thrive in full sun and require a frost-free environment. They are sensitive to cold temperatures and frost, with high humidity favoring fungal diseases. Dry, hot conditions are best for fruit development, and a moderate amount of rainfall is beneficial, though excessive water during fruit ripening can result in poor quality or cracking.",
      "soil": "Well-drained, sandy loam or loamy soils are preferred, with a slightly acidic to neutral pH (~6.0‑7.5). The soil should be fertile and rich in organic matter to ensure strong growth. Muskmelons also require good drainage to prevent root rot, and soil moisture needs to be managed carefully, especially during the fruiting period. Regular composting or organic matter addition is recommended for better yields.",
      "harvest_time": "Muskmelon typically takes 70‑90 days from planting to mature, depending on the variety and growing conditions. The time from flowering to fruit ripening is about 35‑45 days. Harvest when the fruit develops a characteristic sweet aroma, the skin color changes, and the melon separates easily from the vine (a process known as ‘slipping’). Fruits should be handled gently to avoid bruising."
    },
    "tl": {
      "name": "Muskmelon",
      "description": "Ang muskmelon (Cucumis melo) ay isang mainit-init na prutas na kabilang sa pamilya ng lung, na kilala sa matamis, mabangong laman nito at makinis at may lambat na balat. Popular sa buong mundo, ang mga muskmelon ay pinalaki para sa kanilang nakakapreskong lasa, mataas na nilalaman ng tubig, at nutritional value. Mayaman ang mga ito sa bitamina A at C, at kadalasang tinatangkilik ng sariwa, bagama't maaari din itong gamitin sa mga smoothies, salad, at dessert.",
      "climate": "Mainit na katamtaman hanggang tropikal; perpektong temperatura sa pagitan ng 20‑30°C. Ang mga muskmelon ay umuunlad sa buong araw at nangangailangan ng kapaligirang walang hamog na nagyelo. Sila ay sensitibo sa malamig na temperatura at hamog na nagyelo, na may mataas na kahalumigmigan na pinapaboran ang mga fungal disease. Ang tuyo, mainit na mga kondisyon ay pinakamainam para sa pagbuo ng prutas, at ang katamtamang dami ng ulan ay kapaki-pakinabang, kahit na ang labis na tubig sa panahon ng paghinog ng prutas ay maaaring magresulta sa hindi magandang kalidad o pag-crack.",
      "soil": "Mas gusto ang well-drained, sandy loam o loamy soil, na may bahagyang acidic hanggang neutral na pH (~6.0‑7.5). Ang lupa ay dapat na mataba at mayaman sa organikong bagay upang matiyak ang malakas na paglaki. Ang mga muskmelon ay nangangailangan din ng mahusay na drainage upang maiwasan ang pagkabulok ng ugat, at ang kahalumigmigan ng lupa ay kailangang maingat na pangasiwaan, lalo na sa panahon ng fruiting. Ang regular na pag-compost o pagdaragdag ng organikong bagay ay inirerekomenda para sa mas mahusay na ani.",
      "harvest_time": "Ang muskmelon ay karaniwang tumatagal ng 70‑90 araw mula sa pagtatanim hanggang sa mature, depende sa iba't-ibang at lumalagong kondisyon. Ang oras mula sa pamumulaklak hanggang sa paghinog ng prutas ay humigit-kumulang 35‑45 araw. Pag-aani kapag ang prutas ay nagkakaroon ng isang katangian na matamis na aroma, ang kulay ng balat ay nagbabago, at ang melon ay madaling humiwalay sa baging (isang proseso na kilala bilang 'pagdulas'). Ang mga prutas ay dapat hawakan nang malumanay upang maiwasan ang mga pasa."
    }
  },
  "pigeonpeas": {
    "en": {
      "name": "Pigeonpeas",
      "description": "Pigeon pea (Cajanus cajan), also known as red gram, tur, or arhar, is a hardy legume crop cultivated mainly for its protein-rich seeds used in dals and stews. It is a major source of dietary protein in vegetarian diets, especially in South Asia and Africa. Pigeon pea is well-suited to semi-arid regions due to its deep taproot system and drought tolerance. It also improves soil fertility through nitrogen fixation. It can be grown as a sole crop or intercropped with cereals and pulses. Crop duration varies by variety, with short-duration (early maturing) and long-duration (traditional) types available.",
      "climate": "Warm, semi-arid to subtropical climates. Optimal temperatures range from 18–35°C. The crop is drought-tolerant but requires well-distributed rainfall (600–1000 mm) during the growing period. Sensitive to frost and waterlogging, especially during early growth. Long-duration varieties are typically sown at the onset of the monsoon.",
      "soil": "Well-drained loamy or sandy loam soils with a pH of 5.5–7.5 are ideal. Tolerates slightly acidic to neutral soils. Avoid saline, alkaline, or heavy clay soils. Performs well on marginal lands with minimal inputs. Proper soil preparation and weed management improve establishment and yield.",
      "harvest_time": "Harvested 150–270 days after sowing depending on the variety (short to long duration types). Pods are picked when dry and brown. Multiple pickings may be needed in indeterminate varieties. Harvest should be done promptly to avoid shattering and pest damage. After drying, pods are threshed to extract the seeds."
    },
    "tl": {
      "name": "Pigeonpeas",
      "description": "Ang pigeon pea (Cajanus cajan), na kilala rin bilang pulang gramo, tur, o arhar, ay isang matibay na pananim na munggo na nilinang pangunahin para sa mga buto nitong mayaman sa protina na ginagamit sa mga dal at nilaga. Ito ay isang pangunahing pinagmumulan ng dietary protein sa mga vegetarian diet, lalo na sa South Asia at Africa. Ang pigeon pea ay angkop sa mga semi-arid na rehiyon dahil sa malalim nitong taproot system at drought tolerance. Pinapabuti din nito ang pagkamayabong ng lupa sa pamamagitan ng nitrogen fixation. Maaari itong palaguin bilang isang solong pananim o i-intercrop sa mga cereal at pulso. Ang tagal ng pananim ay nag-iiba-iba ayon sa iba't-ibang, na may magagamit na mga short-duration (maagang pag-mature) at long-duration (tradisyonal).",
      "climate": "Mainit, semi-arid hanggang subtropikal na klima. Ang pinakamainam na temperatura ay mula 18–35°C. Ang pananim ay tagtuyot-tolerant ngunit nangangailangan ng mahusay na pamamahagi ng ulan (600–1000 mm) sa panahon ng paglaki. Sensitibo sa hamog na nagyelo at waterlogging, lalo na sa maagang paglaki. Ang mga pangmatagalang uri ay karaniwang itinatanim sa simula ng tag-ulan.",
      "soil": "Tamang-tama ang well-drained loamy o sandy loam soil na may pH na 5.5–7.5. Pinahihintulutan ang bahagyang acidic hanggang neutral na mga lupa. Iwasan ang saline, alkaline, o mabigat na clay soils. Mahusay na gumaganap sa mga marginal na lupain na may kaunting input. Ang wastong paghahanda ng lupa at pamamahala ng mga damo ay nagpapabuti sa pagtatatag at ani.",
      "harvest_time": "Inani 150–270 araw pagkatapos ng paghahasik depende sa iba't (maikli hanggang mahabang uri ng tagal). Pinipili ang mga pod kapag tuyo at kayumanggi. Maaaring kailanganin ang maramihang pagpili sa mga hindi tiyak na uri. Ang pag-aani ay dapat gawin kaagad upang maiwasan ang pagkasira at pagkasira ng mga peste. Pagkatapos matuyo, ang mga pods ay giniik upang kunin ang mga buto."
    }
  },
  "pomegranate": {
    "en": {
      "name": "Pomegranate",
      "description": "Pomegranate (Punica granatum) is a fruit tree known for its colourful and juicy seeds (arils), which are eaten fresh, juiced, or dried. It also has ornamental value. The plant blooms with showy flowers, develops fruits through warm months, and is drought‑tolerant once established. Quality of fruit depends on sunlight, dry climate at ripening, and avoidance of too much humidity which can reduce coloration or increase disease.",
      "climate": "Semi‑arid to arid or hot climates; requires hot, dry summers and mild winters. Optimal temperature for fruit development and ripening between ~25‑35°C; can tolerate higher temperatures; does not do well with prolonged cold or frost; high humidity during fruit set or ripening can be detrimental. Annual rainfall ~500‑800 mm is typical in many good growing areas.",
      "soil": "Well‑drained loamy or sandy loam soils, preferably medium‑deep; soil pH ideally ~5.5‑7.5 (some sources allow up to slightly alkaline). Avoid heavy clay soils with poor drainage. Rich in organic matter is beneficial; soil depth and drainage are particularly important to avoid root issues and fruit cracking.",
      "harvest_time": "Pomegranate trees generally begin bearing fruit within about 2‑3 years after planting (varies by cultivar and growing conditions). Harvest season depends on locale; for many areas the fruit ripens in late summer to autumn (e.g. in tropics/subtropics). Harvest when rind color is mature, fruit size appropriate, arils juicy; careful harvest to avoid fruit damage."
    },
    "tl": {
      "name": "Pomegranate",
      "description": "Ang pomegranate (Punica granatum) ay isang puno ng prutas na kilala sa makulay at makatas na mga buto nito (aril), na kinakain nang sariwa, tinadtad, o pinatuyo. Mayroon din itong ornamental value. Ang halaman ay namumulaklak na may pasikat na bulaklak, namumunga sa mainit-init na mga buwan, at mapagparaya sa tagtuyot kapag naitatag. Ang kalidad ng prutas ay nakasalalay sa sikat ng araw, tuyong klima sa panahon ng pagkahinog, at pag-iwas sa labis na kahalumigmigan na maaaring magpababa ng kulay o magpapataas ng sakit.",
      "climate": "Semi-arid hanggang tigang o mainit na klima; nangangailangan ng mainit, tuyo na tag-araw at banayad na taglamig. Pinakamainam na temperatura para sa pagbuo ng prutas at pagkahinog sa pagitan ng ~25‑35°C; maaaring tiisin ang mas mataas na temperatura; hindi maganda ang ginagawa sa matagal na lamig o hamog na nagyelo; mataas na kahalumigmigan sa panahon ng fruit set o ripening ay maaaring makapinsala. Ang taunang pag-ulan ~500‑800 mm ay karaniwan sa maraming magagandang lugar na lumalago.",
      "soil": "Well-drained loamy o sandy loam soils, mas mabuti na katamtaman ang lalim; ang pH ng lupa ay perpektong ~5.5-7.5 (ang ilang mga mapagkukunan ay nagbibigay-daan sa bahagyang alkalina). Iwasan ang mabibigat na luwad na lupa na may mahinang kanal. Mayaman sa organikong bagay ay kapaki-pakinabang; Ang lalim ng lupa at drainage ay partikular na mahalaga upang maiwasan ang mga isyu sa ugat at pag-crack ng prutas.",
      "harvest_time": "Ang mga puno ng pomegranate ay karaniwang nagsisimulang mamunga sa loob ng humigit-kumulang 2‑3 taon pagkatapos itanim (nag-iiba-iba ayon sa cultivar at lumalaking kondisyon). Ang panahon ng pag-aani ay depende sa lokal; para sa maraming lugar ang prutas ay hinog sa huling bahagi ng tag-araw hanggang taglagas (hal. sa tropiko/subtropiko). Pag-aani kapag ang kulay ng balat ay matanda na, ang sukat ng prutas ay angkop, aril makatas; maingat na pag-aani upang maiwasan ang pagkasira ng prutas."
    }
  },
  "rice": {
    "en": {
      "name": "Rice",
      "description": "Rice (Oryza sativa) is one of the world’s most important staple grains, providing food to billions. It’s grown in diverse ecosystems—flooded paddies, uplands, rainfed lowlands, and irrigated fields. Varieties differ by duration, tolerance to drought/flooding, grain quality, and yield potential. Key practices include water and soil management, pest control, transplanting (if used), nutrient management, and timing of planting/harvesting with seasons.",
      "climate": "Warm, humid climates. Optimal day temperatures around 25‑32°C; nights somewhat cooler but not cold. Needs plentiful water especially in flooded or irrigated systems; many varieties need wet season rains. Sensitive to cold at seedling or flowering stage. Also sensitive to heat during flowering (which may cause sterility).",
      "soil": "Clay loam to silty loam soils with good water‑holding capacity for paddy systems; for upland rice, loamy soils with good organic matter are beneficial. Proper drainage when not flooded, level fields, fertile soils with balanced nutrients, neutral to slightly acidic pH (~5.5‑7.5). Soil health (organic matter, micro‑nutrients) matters greatly.",
      "harvest_time": "Varies widely by variety: from about 90‑130 days (some shorter, some longer) after transplanting or direct seeding, depending on variety and growing system. Harvest when grains are mature, moisture content appropriate (often ~20‑25%), panicles dry or turning golden, before shattering or heavy rains. Post‑harvest drying is critical."
    },
    "tl": {
      "name": "Bigas",
      "description": "Ang bigas (Oryza sativa) ay isa sa pinakamahalagang staple grains sa mundo, na nagbibigay ng pagkain sa bilyun-bilyon. Ito ay lumaki sa magkakaibang ecosystem—binahang palayan, kabundukan, rainfed lowlands, at irigasyon na mga bukirin. Nag-iiba ang mga varieties ayon sa tagal, tolerance sa tagtuyot/pagbaha, kalidad ng butil, at potensyal na ani. Kabilang sa mga pangunahing kasanayan ang pamamahala ng tubig at lupa, pagkontrol ng peste, paglipat (kung ginamit), pamamahala ng sustansya, at oras ng pagtatanim/pag-aani sa mga panahon.",
      "climate": "Mainit, mahalumigmig na klima. Pinakamainam na temperatura sa araw sa paligid ng 25‑32°C; gabi medyo malamig ngunit hindi malamig. Nangangailangan ng maraming tubig lalo na sa baha o irigasyon; maraming uri ang nangangailangan ng tag-ulan. Sensitibo sa lamig sa yugto ng punla o pamumulaklak. Sensitibo din sa init sa panahon ng pamumulaklak (na maaaring magdulot ng sterility).",
      "soil": "Clay loam hanggang silty loam soils na may mahusay na kapasidad na humawak ng tubig para sa mga sistema ng palayan; para sa upland rice, ang mabuhangin na mga lupa na may magandang organikong bagay ay kapaki-pakinabang. Wastong drainage kapag hindi binaha, patag na mga bukirin, matabang lupa na may balanseng nutrients, neutral hanggang bahagyang acidic pH (~5.5‑7.5). Ang kalusugan ng lupa (organic matter, micro-nutrients) ay napakahalaga.",
      "harvest_time": "Malaki ang pagkakaiba-iba ayon sa iba't-ibang: mula sa humigit-kumulang 90‑130 na araw (ang iba ay mas maikli, ang iba ay mas matagal) pagkatapos ng paglipat o direktang pagtatanim, depende sa iba't at lumalagong sistema. Pag-aani kapag hinog na ang mga butil, naaangkop ang moisture content (madalas na ~20‑25%), tuyo o nagiging ginintuang mga panicle, bago magbasag o umulan. Ang pagpapatuyo pagkatapos ng ani ay kritikal."
    }
  },
  "orange": {
    "en": {
      "name": "Orange",
      "description": "Orange (Citrus × sinensis and other citrus spp.) is a widely grown citrus fruit valued for its juicy, sweet‑to‑acidic segments rich in vitamin C. Oranges are eaten fresh, juiced, used in marmalades or other processed products. Trees are evergreen, with showy blossoms, and producing fruit over multiple seasons. Fruit quality depends on cultivar, climate, soil, nutrition, and disease management.",
      "climate": "Subtropical to tropical climates with warm days (around 25‑30°C) and cool nights (around 15‑20°C) during fruit development. Avoid frost and extremes of heat. Rainfall should be moderate and well distributed, though strong dry periods near harvest can help sugar accumulation. A mild dry spell before harvest often improves flavor. ",
      "soil": "Well‑drained loamy or sandy loam soils with good fertility, organic matter, and moisture retention. Soil pH slightly acidic to neutral (~5.5‑7.5). Avoid waterlogging; good root aeration important. Slightly saline soils can be tolerated in some varieties but generally avoided.",
      "harvest_time": "Oranges often begin to bear fruit 2‑4 years after planting (depending on cultivar and care). Flower‑to‑maturity period usually about 7‑12 months, depending on climate and variety. Fruits harvested when color, size, sweetness and acid balance are proper; often as per calendar season (autumn‑winter in many regions)."
    },
    "tl": {
      "name": "Dalandan",
      "description": "Ang orange (Citrus × sinensis at iba pang citrus spp.) ay isang malawak na pinatubo na citrus na prutas na pinahahalagahan para sa kanyang makatas, matamis hanggang acidic na mga segment na mayaman sa bitamina C. Ang mga dalandan ay kinakain ng sariwa, juice, ginagamit sa marmalades o iba pang naprosesong produkto. Ang mga puno ay evergreen, na may matingkad na pamumulaklak, at namumunga sa maraming panahon. Ang kalidad ng prutas ay nakasalalay sa cultivar, klima, lupa, nutrisyon, at pamamahala ng sakit.",
      "climate": "Mga klimang subtropiko hanggang tropikal na may mainit na araw (mga 25‑30°C) at malamig na gabi (mga 15‑20°C) sa panahon ng pagbuo ng prutas. Iwasan ang hamog na nagyelo at labis na init. Ang pag-ulan ay dapat na katamtaman at maayos ang distribusyon, kahit na ang malakas na panahon ng tuyo na malapit sa pag-aani ay maaaring makatulong sa akumulasyon ng asukal. Ang banayad na tuyo bago ang pag-aani ay kadalasang nagpapabuti ng lasa.",
      "soil": "Well-drained loamy o sandy loam soils na may magandang fertility, organic matter, at moisture retention. Ang pH ng lupa ay bahagyang acidic hanggang neutral (~5.5‑7.5). Iwasan ang waterlogging; mahalaga ang magandang aeration ng ugat. Ang bahagyang maalat na mga lupa ay maaaring tiisin sa ilang uri ngunit sa pangkalahatan ay iniiwasan.",
      "harvest_time": "Ang mga dalandan ay kadalasang nagsisimulang mamunga 2‑4 na taon pagkatapos itanim (depende sa cultivar at pangangalaga). Ang panahon ng bulaklak hanggang sa kapanahunan ay karaniwang humigit-kumulang 7-12 buwan, depende sa klima at uri. Mga prutas na inaani kapag ang kulay, sukat, tamis at balanse ng acid ay wasto; madalas ayon sa panahon ng kalendaryo (taglagas‑taglamig sa maraming rehiyon)."
    }
  },
  "papaya": {
    "en": {
      "name": "Papaya",
      "description": "Papaya (Carica papaya) is a fast‑growing tropical fruit tree (technically a large herb), valued for its soft, sweet flesh, rich in vitamins A and C. Papaya can produce fruit relatively quickly, making it popular for smallholders. It is sensitive to cold, wind, and certain diseases; pest control, soil fertility, and good drainage are essential for healthy growth and high yields.",
      "climate": "Tropical; warm all year, frost‑free; temperatures ideally between 25‑32°C. High humidity can favor disease, so good airflow and management help. Rainfall abundant but well distributed; heavy rainfall or flooding can damage roots or cause fungal issues. Protection from strong wind is important.",
      "soil": "Well‑drained loamy or sandy loam soils rich in organic matter. Slightly acidic to neutral pH (~6.0‑7.0). Soil should allow good drainage (to avoid root rot) and retain enough moisture. Fertility (N, P, K plus micronutrients) is important for fruit set and quality.",
      "harvest_time": "Papaya can begin producing fruit often within 6‑12 months after planting under good conditions. The time from flowering to mature fruit is about 4‑6 months depending on variety. Harvest when fruits are mature (skin color change, size, softness) often while still firm for transport, then ripened off the tree."
    },
    "tl": {
      "name": "Papaya",
      "description": "Ang Papaya (Carica papaya) ay isang mabilis na lumalagong tropikal na puno ng prutas (teknikal na isang malaking damo), na pinahahalagahan para sa malambot, matamis na laman nito, mayaman sa bitamina A at C. Ang papaya ay maaaring magbunga nang medyo mabilis, na ginagawa itong popular sa mga maliliit na may-ari. Ito ay sensitibo sa malamig, hangin, at ilang mga sakit; Ang pagkontrol ng peste, pagkamayabong ng lupa, at mahusay na pagpapatuyo ay mahalaga para sa malusog na paglaki at mataas na ani.",
      "climate": "Tropikal; mainit sa buong taon, walang hamog na nagyelo; perpektong temperatura sa pagitan ng 25‑32°C. Ang mataas na kahalumigmigan ay maaaring pabor sa sakit, kaya mahusay na daloy ng hangin at tulong sa pamamahala. Sagana ang ulan ngunit maayos ang pamamahagi; ang malakas na pag-ulan o pagbaha ay maaaring makapinsala sa mga ugat o maging sanhi ng mga isyu sa fungal. Ang proteksyon mula sa malakas na hangin ay mahalaga.",
      "soil": "Well-drained loamy o sandy loam soils na mayaman sa organikong bagay. Bahagyang acidic hanggang neutral pH (~6.0‑7.0). Dapat pahintulutan ng lupa ang mahusay na pagpapatuyo (upang maiwasan ang pagkabulok ng ugat) at mapanatili ang sapat na kahalumigmigan. Ang fertility (N, P, K plus micronutrients) ay mahalaga para sa set at kalidad ng prutas.",
      "harvest_time": "Ang papaya ay maaaring magsimulang mamunga nang madalas sa loob ng 6‑12 buwan pagkatapos itanim sa ilalim ng magandang kondisyon. Ang oras mula sa pamumulaklak hanggang sa mature na prutas ay humigit-kumulang 4‑6 na buwan depende sa uri. Mag-aani kapag ang mga prutas ay hinog na (pagbabago ng kulay ng balat, laki, lambot) nang madalas habang matatag pa para dalhin, pagkatapos ay hinog mula sa puno."
    }
  },
  "watermelon": {
    "en": {
      "name": "Watermelon",
      "description": "Watermelon (Citrullus lanatus) is a fast‑growing vine crop cultivated for its large, sweet, juicy fruits. It’s often planted seasonally; needs warm soil and air, good sunlight, adequate water especially during fruit expansion, and careful management of pests and diseases. Variety choice is important (seeded vs seedless, rind thickness, pulp firmness, sugar content).",
      "climate": "Warm to hot climates; frost‐free growing season. Ideal daytime temperatures ~25‑35°C and warm nights. Plenty of sunshine. Sensitive to cold; growth slows at lower temperatures. Requires warm soil (soil temp at planting above ~18‑20°C) for good germination.",
      "soil": "Light, well‑drained sandy loam or loam soils; soil rich in organic matter helps. Neutral to slightly acidic pH (~6.0‑7.5). Avoid waterlogging. Good soil preparation (removing weeds, tilling) helps. Mulch or shade can help maintain sufficient soil moisture and temperature in hot weather.",
      "harvest_time": "Between 70‑90 days from sowing (or transplant) to harvest for many varieties, depending on variety, climate, and spacing. Harvest when rind color pattern is mature, fruit produces a hollow sound when tapped, tendril near fruit dries, and sugar content is sufficient. Timing depends on variety and weather."
    },
    "tl": {
      "name": "Pakwan",
      "description": "Ang pakwan (Citrullus lanatus) ay isang mabilis na lumalagong pananim na baging na nilinang para sa malalaki, matamis, makatas na prutas nito. Madalas itong itinatanim sa pana-panahon; nangangailangan ng mainit na lupa at hangin, magandang sikat ng araw, sapat na tubig lalo na sa panahon ng paglaki ng prutas, at maingat na pamamahala ng mga peste at sakit. Mahalaga ang pagpili ng iba't ibang uri (seeded vs seedless, kapal ng balat, katigasan ng pulp, nilalaman ng asukal).",
      "climate": "Mainit hanggang sa mainit na klima; panahon ng lumalagong walang hamog na nagyelo. Mainam na temperatura sa araw ~25‑35°C at mainit na gabi. Maraming sikat ng araw. Sensitibo sa malamig; bumabagal ang paglago sa mas mababang temperatura. Nangangailangan ng mainit na lupa (temperatura ng lupa sa pagtatanim sa itaas ~18‑20°C) para sa mabuting pagtubo.",
      "soil": "Banayad, mahusay na pinatuyo na mabuhangin na loam o loam soils; nakakatulong ang lupa na mayaman sa organikong bagay. Neutral hanggang bahagyang acidic pH (~6.0‑7.5). Iwasan ang waterlogging. Ang mahusay na paghahanda ng lupa (pag-alis ng mga damo, pagbubungkal) ay nakakatulong. Makakatulong ang mulch o shade na mapanatili ang sapat na kahalumigmigan at temperatura ng lupa sa mainit na panahon.",
      "harvest_time": "Sa pagitan ng 70‑90 araw mula sa paghahasik (o paglipat) hanggang sa pag-aani para sa maraming uri, depende sa uri, klima, at espasyo. Pag-aani kapag ang pattern ng kulay ng balat ay hinog na, ang prutas ay gumagawa ng isang guwang na tunog kapag tinapik, ang lambot malapit sa prutas ay natuyo, at ang nilalaman ng asukal ay sapat. Ang oras ay depende sa iba't-ibang at panahon."
    }
  },
  "wheat": {
    "en": {
      "name": "Wheat",
      "description": "Wheat (Triticum spp.) is a major cereal crop used for food (bread, noodles, pastries, etc.). There are spring and winter wheat types, with different requirements. Wheat is grown in temperate to semi‑arid regions. Production depends on moisture, temperature especially during flowering and grain fill, soil fertility, and good pest/disease management.",
      "climate": "Temperate to cool temperate climates, sometimes semi‑arid. For winter wheat, cold temperatures (vernalization) are required; spring wheat grown where winter cold is insufficient. Optimal temperatures ~18‑24°C during grain filling; high heat or drought during flowering/grain fill reduces yield. Rainfall moderate; too much moisture at harvest can be problematic.",
      "soil": "Well‑drained loamy or clay loam soils with good fertility and moisture retention. Slightly acidic to neutral soils (~6.0‑7.5 pH). Soil structure important; avoid waterlogging; root zone should be deep. Nutrient management especially nitrogen, phosphorus, potassium essential.",
      "harvest_time": "Generally about 100‑130 days from sowing to maturity for many spring wheat types; winter wheat takes longer. Harvest when grains are hard, moisture low, before risk of shattering or rain damage. Straw becomes yellow, plant senescence visible."
    }, 
    "tl": {
      "name": "Trigo",
      "description": "Ang trigo (Triticum spp.) ay isang pangunahing pananim na cereal na ginagamit para sa pagkain (tinapay, noodles, pastry, atbp.). May mga uri ng trigo sa tagsibol at taglamig, na may iba't ibang mga kinakailangan. Ang trigo ay itinatanim sa mga rehiyon na may katamtaman hanggang semi-arid. Ang produksyon ay nakasalalay sa kahalumigmigan, temperatura lalo na sa panahon ng pamumulaklak at pagpuno ng butil, pagkamayabong ng lupa, at mahusay na pamamahala ng peste/sakit.",
      "climate": "Temperate to cool temperate climates, minsan semi-arid. Para sa taglamig na trigo, ang malamig na temperatura (vernalization) ay kinakailangan; tagsibol trigo lumago kung saan ang taglamig malamig ay hindi sapat. Pinakamainam na temperatura ~18‑24°C sa panahon ng pagpuno ng butil; ang mataas na init o tagtuyot sa panahon ng pamumulaklak/pagpuno ng butil ay nakakabawas sa ani. Katamtaman ang pag-ulan; masyadong maraming kahalumigmigan sa pag-aani ay maaaring maging problema.",
      "soil": "Well-drained loamy o clay loam soils na may magandang fertility at moisture retention. Bahagyang acidic hanggang neutral na mga lupa (~6.0‑7.5 pH). Mahalaga ang istraktura ng lupa; maiwasan ang waterlogging; Ang root zone ay dapat na malalim. Pamamahala ng nutrisyon lalo na ang nitrogen, phosphorus, potassium essential.",
      "harvest_time": "Sa pangkalahatan ay humigit-kumulang 100‑130 araw mula sa paghahasik hanggang sa kapanahunan para sa maraming uri ng spring wheat; mas matagal ang trigo ng taglamig. Mag-ani kapag matigas ang mga butil, mababa ang kahalumigmigan, bago ang panganib ng pagkabasag o pagkasira ng ulan. Ang dayami ay nagiging dilaw, nakikita ang senescence ng halaman."
    }
  }
}
