{
  "apple": {
    "description": "Apple (Malus domestica) is a deciduous tree fruit prized for its wide variety of flavors, textures, sizes, and colors. Apples are consumed fresh, baked, juiced, or preserved, and can be used in sauces, desserts, cider, and other processed foods. Apple trees require distinct seasons—dormancy in winter, blossom in spring, and fruit development in summer into autumn. The fruit’s flavor, crispness, and storage capacity depend heavily on cultivar, growing conditions, altitude, and orchard management.",
    "climate": "Temperate regions with cold winters (to satisfy chill‑hour requirements), frost‐free flowering periods, warm days in summer (~20‑30°C), cooler nights for flavor development. Tolerates slight frost in dormant periods but young trees and blossoms are sensitive to late spring frosts.",
    "soil": "Deep, well‑drained loamy or silt‑loam soils rich in organic matter, pH approximately 5.5‑7.5. Good moisture retention but avoid waterlogging; rootstock choice, drainage, and fertility (especially nitrogen, potassium, magnesium) are important.",
    "harvest_time": "Approximately 4‑7 months from flowering to fruit maturity depending on cultivar and climate. Harvest season generally in late summer to fall (varies by region). Fruit should be harvested when skin color is appropriate for cultivar, firmness is good, and seeds are fully developed. Post‑harvest cooling helps maintain quality."
  },
  "banana": {
    "description": "Banana (Musa spp.) is a perennial, herbaceous crop grown for its sweet, fleshy fruit. It is one of the world’s most widely produced fruit crops. Bananas are used fresh, in cooking (especially plantains), drying, and processing. Each pseudostem produces a single bunch; after harvest, suckers or new shoots produce the next crop. Disease management, wind protection, and high nutrient and water availability are key to good yields.",
    "climate": "Warm and humid tropical or subtropical regions; ideal daytime temperatures about 26‑30°C; sensitive to cold and frost (below ~10‑12°C can damage growth). Requires high rainfall or reliable irrigation (often 1,200‑2,500 mm/year) and humidity; full sun exposure with wind protection is beneficial.",
    "soil": "Well‑drained, fertile loamy soils rich in organic matter; pH about 5.5‑7.0. Avoid heavy clay soils or waterlogged soils. Good drainage is essential to prevent root rot. Soil should support high nutrient turnover particularly for potassium, nitrogen.",
    "harvest_time": "Bananas take about 9‑18 months from planting to first harvest, depending on variety, climate, care. From flowering to fruit maturity (bunch maturity) often 2‑4 months, depending on variety and conditions. Further ratoon crops may be harvested sooner."
  },
  "chickpea": {
    "description": "Chickpea (Cicer arietinum) is an annual legume cultivated for its nutritious seeds used whole or ground in many culinary dishes. It fixes nitrogen in the soil, making it useful in crop rotations. Chickpea plants are relatively drought tolerant, but yield and seed quality depend on timely moisture, good soil fertility, and disease/pest management.",
    "climate": "Prefers semi‐arid to temperate climates; cool to moderate winters and warm, dry summers. Sensitive to frost during flowering; too high heat or drought during pod filling reduces yields. Moderate rainfall is sufficient, but excess moisture can lead to disease. Temperatures ~18‑30°C during growth are favorable, with cooler nights improving pod formation.",
    "soil": "Well‐drained soils: loamy, clay loam, or sandy loam with good organic matter. Soil should have neutral to slightly alkaline pH (~6.0‑8.0). Soils prone to waterlogging or heavy and compact clay are less ideal. Good fertility (especially phosphorus) is important. “Fixation” of nitrogen reduces need for heavy N fertilizer. ",
    "harvest_time": "Typically about 90‑120 days after sowing, depending on variety and climate. Harvest when pods are mature and dry (pods brown, seeds firm). Moisture content low to allow storage; sometimes multiple picks or drying may be needed."
  },
  "coconut": {
    "description": "Coconut (Cocos nucifera) is a tropical perennial palm valued for its multi‑purpose uses: food (coconut water, flesh), oil, coir, timber, and more. Coconut palms can live for many years, producing fruit once they mature. They are important for coastal and island agriculture, both for household consumption and commercial products. Palms are tolerant of salt spray; often part of agroforestry systems or coastal protection.",
    "climate": "Strictly tropical climates; warm, humid, frost‑free. Ideal temperatures around 25‑30°C; intolerant of cold/frost. Requires high annual rainfall (1500‑2500 mm or more); well‑distributed rainfall helps fruiting and growth. Full sun is essential; some tolerance to wind, especially coastal, but very strong winds (typhoons) can damage fronds and nuts.",
    "soil": "Sandy to loamy soils, well‑drained, with good depth to allow root penetration. Tolerates sandy coastal soils, even some salinity, so long as root zone has moisture and nutrients. Soil pH from slightly acidic to neutral (~5.5‑7.5). High organic matter helps. Avoid waterlogged or compacted soils. ",
    "harvest_time": "Coconut palms begin fruiting typically in 3‑6 years after planting, depending on variety and establishment conditions. Nuts mature in ~10‑12 months after flowering, though maturity depends on intended use (young green nuts vs mature brown coconuts). Harvesting is ongoing (multiple harvests per year) once palm reaches productivity."
  },
  "coffee": {
    "description": "Coffee (Coffea spp.) refers to perennial shrubs grown for their seeds (“beans”) that are roasted and brewed as the popular beverage. Two main commercially important species are Arabica and Robusta. Coffee growing involves precise timing of flowering, cherry development, harvest, and processing. Shade, altitude, and soil fertility significantly affect flavor, yield, and bean quality. Trees need a few years to establish.",
    "climate": "Tropical to subtropical climates; coffee often grows best at higher elevations (for Arabica) where temperatures are more mild (e.g. ~15‑24°C), while Robusta tolerates higher temperature (~24‑30°C). Needs distinct wet and dry periods to induce flowering and allow drying of cherries. Sensitive to frost and extreme heat. Adequate rainfall (often 1,500‑2,500 mm/year) with dry spells during harvest are beneficial. ",
    "soil": "Deep, fertile, well‑drained soils with good organic matter. Acidic soils are preferred (pH ~5.0‑6.5), though Robusta can tolerate slightly higher. Soil structure should allow good root depth; volcanic soils are often favorable in many coffee regions. Shade trees and mulching help maintain moisture and soil health. ",
    "harvest_time": "Coffee trees typically begin producing usable harvests in about 3‑4 years after planting. Harvesting usually occurs once cherries ripen; in many regions this is once a year, or multiple harvests / pickings in parts of the tropics. The period from flowering to berry maturity is often 7‑9 months for Arabica; may be shorter for Robusta. "
  },
  "cotton": {
    "description": "Cotton (Gossypium spp.) is a fiber crop whose fibers are harvested from seed bolls. It is key for textiles but also has by‑products like cottonseed oil and cake. Cotton is a seasonal annual crop, requiring moisture in early stages, dry conditions during maturation, and warm weather. Pests (like bollworms) and disease control are important. Crop rotation and soil fertility are essential.",
    "climate": "Warm to hot climates; ideal daytime temperatures ~25‑35°C, tolerates heat but sensitive to frost. Requires a long frost‑free period. Rainfall moderately low or seasonal; too much rain during boll opening causes losses. Dry conditions near harvest are beneficial. ",
    "soil": "Deep, well‑drained soils, loamy, sandy loam, fertile; neutral to slightly acidic to slightly alkaline pH (~6.0‑8.0). Good soil structure to allow root development. Avoid heavy clay or water‑logging. Adequate nutrients especially nitrogen, potassium, phosphorus. Organic matter improves yield. ",
    "harvest_time": "Usually about 5‑6 months from sowing to harvest, depending on growing season, cultivar, climate, and soil fertility. Harvest when bolls are open, fibers fluffy, with minimal moisture to avoid rot. Sometimes multiple picking rounds if staggered boll opening."
  },
  "grapes": {
    "description": "Grapes (Vitis spp.) are woody perennial vines grown for their fruit, consumed fresh, dried (raisins), or used for juice/wine. Grapevine varieties vary with respect to flavor, color, size, yield, disease resistance, and climate needs. Vine training, pruning, pest/fungal disease management, and irrigation are critical. Soil fertility, drainage, and climatic conditions strongly influence sugar content, acidity, and fruit quality.",
    "climate": "Requires moderate to warm climates; many grape varieties need defined seasons with warm growing periods (20‑30°C), cooler nights for flavor and sugar accumulation, and dry weather near harvest to avoid fungal diseases. Frost is damaging to vines and blossoms. Winter dormant period is needed for many varieties. ",
    "soil": "Well‑drained loamy soils or sandy loam, with good organic matter. Soil pH generally about 5.5‑7.5. Soils with good drainage to avoid waterlogging; shallow soils or poor structure reduce root health. Deep soils help for root anchorage. Soil fertility, especially potassium, helps fruit quality. ",
    "harvest_time": "Typically 100‑120 days from flowering to harvest in many table grape varieties; can vary depending on cultivar and climate. Harvest when grapes are fully colored, sugar levels are optimal, flavor is ripe, and acidity has balanced decline. Under favorable conditions, sometimes multiple harvests or staggered picks."
  },
  "munggo": {
    "description": "Munggo (also mung bean, Vigna radiata) is a fast‑growing legume crop used for its edible seeds and sprouts. It is highly valued for its nutritional quality (protein, vitamins), drought tolerance, and ability to fix nitrogen, improving soil fertility. It is often planted in rotation with staple cereals or used in intercropping systems. It has a relatively short life cycle and can produce multiple harvests or relay cropping in favourable seasons.",
    "climate": "Warm to hot climates, frost‑free. Optimal daytime temperatures around 25‑35°C, nights somewhat cooler but not below ~15‑18°C. Moderate rainfall timed well: enough moisture during germination, flowering and pod fill, but too much rain near harvest can reduce quality or cause disease. Well distributed rainfall is good or supplemental irrigation if needed.",
    "soil": "Well‑drained sandy loam or loam soils, fertile with good organic matter. Slightly acidic to neutral pH (~5.8‑7.2). Soils that retain moisture well but avoid waterlogging. Inoculation with rhizobia improves nitrogen fixation and yield. ",
    "harvest_time": "Usually about 60‑70 days from sowing to harvest, depending on variety and growing conditions. Harvest when pods are mature, mostly dry, seeds firm. Proper drying post‑harvest improves storability."
  },
  "mothbeans": {
    "description": "Moth bean (Vigna aconitifolia) is a drought-tolerant legume grown in arid and semi-arid regions. It produces small, oval brown seeds rich in protein and minerals, used in traditional dishes or as sprouts. Its fast growth, low water needs, and nitrogen-fixing ability make it valuable for dryland farming and crop rotation. It is also used as fodder and supports food security in poor soils and harsh climates.",
    "climate": "Best suited to hot, dry climates with temperatures between 25–35°C and annual rainfall of 200–500 mm. It thrives in areas with short, erratic monsoons and tolerates drought well. Excessive rain or humidity can cause fungal problems. Commonly grown during the monsoon season as a short-duration crop that matures quickly before moisture runs out.",
    "soil": "Grows well in sandy or loamy soils that are well-drained, with a pH between 6.5 and 8.5. Tolerates poor, dry soils but responds to small phosphorus inputs. Waterlogging must be avoided. Its nitrogen-fixing roots improve soil fertility, making it a good crop for rotation and degraded lands with minimal inputs.",
    "harvest_time": "Ready to harvest in about 60–75 days after sowing. Plants are cut or uprooted when most pods turn brown and dry. After field drying, seeds are threshed and further dried before storage. Proper drying prevents mold and ensures long shelf life. Yields are reliable even under limited water conditions."
  },
  "mais": {
    "description": "Mais (corn) is a major cereal grain used for human consumption, animal feed, and industrial uses. It thrives under warm conditions, has high yield potential, and its productivity depends on sunlight, moisture, soil fertility, and pest/disease management. Corn can be grown in many environments; varieties adapted to local conditions are important.",
    "climate": "Warm, frost‑free climates; optimal daytime temperatures about 25‑32°C; nights somewhat cooler but not too cold. Requires full sun, sufficient moisture especially during germination, flowering, and grain fill. Sensitive to drought during critical growth stages (tasseling, silking).",
    "soil": "Loamy or silty loam soils, well‑drained, deep, fertile soil with good organic matter; pH ideally between ~5.8‑7.5. Soils with good water retention but not prone to waterlogging. Adequate nutrients (nitrogen especially) are important.",
    "harvest_time": "Typically around 80‑120 days from planting to harvest for many corn varieties, depending on cultivar, climate, soil fertility, and whether sweet corn or field corn. Harvest when kernels are full and grains have reached desired moisture or maturity stage."
  },
  "mango": {
    "description": "Mango (Mangifera indica) is a tropical tree fruit known for its sweet, juicy, aromatic fruits. There are many cultivars, varying in size, color, flavor, fiber content, and season of maturity. Mangoes are eaten fresh, processed into dried fruit, juices, jams, and many culinary products. Trees are long‑lived and may produce for many years with proper care, pruning, fertilization, and pest/disease management.",
    "climate": "Tropical to subtropical climates. Warm dry periods often help flowering; moderate to high temperatures (24‑35°C) during growth; some cooling/drier weather before flowering can improve fruit set. Mangoes are somewhat drought tolerant once established, but young trees need consistent moisture. Sensitive to frost. High humidity late in the season may increase disease risk.",
    "soil": "Well‑drained sandy loam or loam; deep soil that allows root penetration; rich in organic matter. Neutral to slightly acidic to alkaline pH (5.5‑7.5). Heavy clay soils that retain water or stay saturated are problematic. Good drainage is essential, particularly during rainy season to avoid root rot.",
    "harvest_time": "Typically 3‑5 years after planting to get good yields (depending on cultivar). Flower‑to‑harvest period ranges about 3‑6 months, depending on cultivar and climate. Harvest season usually once a year; fruit picked when mature (size, color, aroma), sometimes earlier to allow transport ripening."
  },
  "pomegranate": {
    "description": "Pomegranate (Punica granatum) is a fruit tree known for its colourful and juicy seeds (arils), which are eaten fresh, juiced, or dried. It also has ornamental value. The plant blooms with showy flowers, develops fruits through warm months, and is drought‑tolerant once established. Quality of fruit depends on sunlight, dry climate at ripening, and avoidance of too much humidity which can reduce coloration or increase disease.",
    "climate": "Semi‑arid to arid or hot climates; requires hot, dry summers and mild winters. Optimal temperature for fruit development and ripening between ~25‑35°C; can tolerate higher temperatures; does not do well with prolonged cold or frost; high humidity during fruit set or ripening can be detrimental. Annual rainfall ~500‑800 mm is typical in many good growing areas.",
    "soil": "Well‑drained loamy or sandy loam soils, preferably medium‑deep; soil pH ideally ~5.5‑7.5 (some sources allow up to slightly alkaline). Avoid heavy clay soils with poor drainage. Rich in organic matter is beneficial; soil depth and drainage are particularly important to avoid root issues and fruit cracking.",
    "harvest_time": "Pomegranate trees generally begin bearing fruit within about 2‑3 years after planting (varies by cultivar and growing conditions). Harvest season depends on locale; for many areas the fruit ripens in late summer to autumn (e.g. in tropics/subtropics). Harvest when rind color is mature, fruit size appropriate, arils juicy; careful harvest to avoid fruit damage."
  },
  "rice": {
    "description": "Rice (Oryza sativa) is one of the world’s most important staple grains, providing food to billions. It’s grown in diverse ecosystems—flooded paddies, uplands, rainfed lowlands, and irrigated fields. Varieties differ by duration, tolerance to drought/flooding, grain quality, and yield potential. Key practices include water and soil management, pest control, transplanting (if used), nutrient management, and timing of planting/harvesting with seasons.",
    "climate": "Warm, humid climates. Optimal day temperatures around 25‑32°C; nights somewhat cooler but not cold. Needs plentiful water especially in flooded or irrigated systems; many varieties need wet season rains. Sensitive to cold at seedling or flowering stage. Also sensitive to heat during flowering (which may cause sterility).",
    "soil": "Clay loam to silty loam soils with good water‑holding capacity for paddy systems; for upland rice, loamy soils with good organic matter are beneficial. Proper drainage when not flooded, level fields, fertile soils with balanced nutrients, neutral to slightly acidic pH (~5.5‑7.5). Soil health (organic matter, micro‑nutrients) matters greatly.",
    "harvest_time": "Varies widely by variety: from about 90‑130 days (some shorter, some longer) after transplanting or direct seeding, depending on variety and growing system. Harvest when grains are mature, moisture content appropriate (often ~20‑25%), panicles dry or turning golden, before shattering or heavy rains. Post‑harvest drying is critical."
  },
  "orange": {
    "description": "Orange (Citrus × sinensis and other citrus spp.) is a widely grown citrus fruit valued for its juicy, sweet‑to‑acidic segments rich in vitamin C. Oranges are eaten fresh, juiced, used in marmalades or other processed products. Trees are evergreen, with showy blossoms, and producing fruit over multiple seasons. Fruit quality depends on cultivar, climate, soil, nutrition, and disease management.",
    "climate": "Subtropical to tropical climates with warm days (around 25‑30°C) and cool nights (around 15‑20°C) during fruit development. Avoid frost and extremes of heat. Rainfall should be moderate and well distributed, though strong dry periods near harvest can help sugar accumulation. A mild dry spell before harvest often improves flavor. ",
    "soil": "Well‑drained loamy or sandy loam soils with good fertility, organic matter, and moisture retention. Soil pH slightly acidic to neutral (~5.5‑7.5). Avoid waterlogging; good root aeration important. Slightly saline soils can be tolerated in some varieties but generally avoided.",
    "harvest_time": "Oranges often begin to bear fruit 2‑4 years after planting (depending on cultivar and care). Flower‑to‑maturity period usually about 7‑12 months, depending on climate and variety. Fruits harvested when color, size, sweetness and acid balance are proper; often as per calendar season (autumn‑winter in many regions)."
  },
  "papaya": {
    "description": "Papaya (Carica papaya) is a fast‑growing tropical fruit tree (technically a large herb), valued for its soft, sweet flesh, rich in vitamins A and C. Papaya can produce fruit relatively quickly, making it popular for smallholders. It is sensitive to cold, wind, and certain diseases; pest control, soil fertility, and good drainage are essential for healthy growth and high yields.",
    "climate": "Tropical; warm all year, frost‑free; temperatures ideally between 25‑32°C. High humidity can favor disease, so good airflow and management help. Rainfall abundant but well distributed; heavy rainfall or flooding can damage roots or cause fungal issues. Protection from strong wind is important.",
    "soil": "Well‑drained loamy or sandy loam soils rich in organic matter. Slightly acidic to neutral pH (~6.0‑7.0). Soil should allow good drainage (to avoid root rot) and retain enough moisture. Fertility (N, P, K plus micronutrients) is important for fruit set and quality.",
    "harvest_time": "Papaya can begin producing fruit often within 6‑12 months after planting under good conditions. The time from flowering to mature fruit is about 4‑6 months depending on variety. Harvest when fruits are mature (skin color change, size, softness) often while still firm for transport, then ripened off the tree."
  },
  "watermelon": {
    "description": "Watermelon (Citrullus lanatus) is a fast‑growing vine crop cultivated for its large, sweet, juicy fruits. It’s often planted seasonally; needs warm soil and air, good sunlight, adequate water especially during fruit expansion, and careful management of pests and diseases. Variety choice is important (seeded vs seedless, rind thickness, pulp firmness, sugar content).",
    "climate": "Warm to hot climates; frost‐free growing season. Ideal daytime temperatures ~25‑35°C and warm nights. Plenty of sunshine. Sensitive to cold; growth slows at lower temperatures. Requires warm soil (soil temp at planting above ~18‑20°C) for good germination.",
    "soil": "Light, well‑drained sandy loam or loam soils; soil rich in organic matter helps. Neutral to slightly acidic pH (~6.0‑7.5). Avoid waterlogging. Good soil preparation (removing weeds, tilling) helps. Mulch or shade can help maintain sufficient soil moisture and temperature in hot weather.",
    "harvest_time": "Between 70‑90 days from sowing (or transplant) to harvest for many varieties, depending on variety, climate, and spacing. Harvest when rind color pattern is mature, fruit produces a hollow sound when tapped, tendril near fruit dries, and sugar content is sufficient. Timing depends on variety and weather."
  },
  "wheat": {
    "description": "Wheat (Triticum spp.) is a major cereal crop used for food (bread, noodles, pastries, etc.). There are spring and winter wheat types, with different requirements. Wheat is grown in temperate to semi‑arid regions. Production depends on moisture, temperature especially during flowering and grain fill, soil fertility, and good pest/disease management.",
    "climate": "Temperate to cool temperate climates, sometimes semi‑arid. For winter wheat, cold temperatures (vernalization) are required; spring wheat grown where winter cold is insufficient. Optimal temperatures ~18‑24°C during grain filling; high heat or drought during flowering/grain fill reduces yield. Rainfall moderate; too much moisture at harvest can be problematic.",
    "soil": "Well‑drained loamy or clay loam soils with good fertility and moisture retention. Slightly acidic to neutral soils (~6.0‑7.5 pH). Soil structure important; avoid waterlogging; root zone should be deep. Nutrient management especially nitrogen, phosphorus, potassium essential.",
    "harvest_time": "Generally about 100‑130 days from sowing to maturity for many spring wheat types; winter wheat takes longer. Harvest when grains are hard, moisture low, before risk of shattering or rain damage. Straw becomes yellow, plant senescence visible."
  }
}
